
&НаКлиенте
Процедура ОткрытьФормуОтчета(Команда)
		
	ОткрытьФорму("Отчет.Продажи.ФормаОбъекта");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчетаСАвтоФормированием(Команда)
	
	СтруктураПараметров = Новый Структура("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.Продажи.ФормаОбъекта", СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчетаСОтбором(Команда)
	
	Отбор = Новый Структура("Номенклатура", Объект.Номенклатура);
	Отбор.Вставить("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	Отбор.Вставить("КонецПериода", КонецМесяца(ТекущаяДата()));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Отбор);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина); 
	СтруктураПараметров.Вставить("КлючВарианта", "Основной");
	
	ОткрытьФорму("Отчет.Продажи.ФормаОбъекта", СтруктураПараметров); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчетаВарианта(Команда)

	Отбор = Новый Структура("Номенклатура", Объект.Номенклатура);
	Отбор.Вставить("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	Отбор.Вставить("КонецПериода", КонецМесяца(ТекущаяДата()));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Отбор);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("КлючВарианта", "Диаграмма");
	
	ОткрытьФорму("Отчет.Продажи.ФормаОбъекта", СтруктураПараметров); 

КонецПроцедуры
