Процедура ЗаполнитьНомераТелефонов()Экспорт
	
	//очистка реквизита
	НомераТелефонов = "";
	//обход строк табличной части
	Для каждого СтрокаТЧ Из КонтактнаяИнформация Цикл
		
		Если СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			//заполнение реквизита
			НомераТелефонов = НомераТелефонов + СтрокаТЧ.Значение;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЗаполнитьНомераТелефонов();	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		РеквизитИНН = ПроверяемыеРеквизиты.Найти("ИНН");
		ПроверяемыеРеквизиты.Удалить(РеквизитИНН);
	КонецЕсли; 
	
КонецПроцедуры



