
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ЧтоДелатьПосле = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(ЧтоДелатьПосле);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	ДанныеФайла = Строка(ДвоичныеДанные);
	

КонецПроцедуры // ПослеВыбораФайла()
