
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСвойстваЭлементовФормы();
	
	Если Объект.Ссылка.Пустая() Тогда
		//это новый элемент (ещё не записан в базу)
		Элементы.ОсновнойДоговор.Видимость = Ложь;
	Иначе
		ОсновнойДоговор = ПолучитьОсновнойДоговорКонтрагента(Объект.Ссылка);	
	КонецЕсли; 
	
	//1. создание группы
	ЭлементГруппа = Элементы.Добавить("ГруппаНовыеРеквизиты", Тип("ГруппаФормы"));
	ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппа.ОтображатьЗаголовок = Ложь;
	ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	//2. создание элемента "Страна регистрации" внутри группы
	ЭлементСтрана = Элементы.Добавить("СтранаРегистрации", Тип("ПолеФормы"), ЭлементГруппа);
	ЭлементСтрана.ПутьКДанным = "Объект.СтранаРегистрации";
	ЭлементСтрана.Вид = ВидПоляФормы.ПолеВвода;
	
	//3. создание элемента "КПП" внутри группы
	ЭлементКПП = Элементы.Добавить("КПП", Тип("ПолеФормы"), ЭлементГруппа);
	ЭлементКПП.ПутьКДанным = "Объект.КПП";
	ЭлементКПП.Вид = ВидПоляФормы.ПолеВвода;
	
	//4. перемещение группы в нужное место на форме
	Элементы.Переместить(ЭлементГруппа, ЭтотОбъект, Элементы.ОсновнойДоговор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойДоговорКонтрагента(Контрагент)

	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Основной", Истина,,Контрагент);

	Возврат Договор;
	
КонецФункции


&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	
	ОбновитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСвойстваЭлементовФормы()

	Если Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		Элементы.Наименование.Заголовок = "ФИО";
		Элементы.ИНН.Видимость = Ложь;
	Иначе
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ИНН.Видимость = Истина;		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоУНП(Команда)
	
	//проверка на заполненность "УНП"
	Если ПустаяСтрока(Объект.ИНН) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция невозможна: не заполнен ИНН!";
		Сообщение.Поле = "Объект.ИНН";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Хост = "www.portal.nalog.gov.by";
	Ресурс = "grp/getData?unp="+СокрЛП(Объект.ИНН);
	
	//создание HTTP-соединения и HTTP-запроса
	Соединение = Новый HTTPСоединение(Хост);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("host", Хост);
	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	//отправка HTTP-запроса серверу и получение ответа
	Ответ = Неопределено;
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		Возврат;
	КонецПопытки;
	//чтение ответа HTTP-сервера
	СведенияXML = Неопределено;
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		
		СведенияXML = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		Возврат;
	КонецПопытки;
	Если ТипЗнч(СведенияXML) = Тип("ОбъектXDTO") Тогда
		Если СведенияXML.Свойства().Получить("ROW")=Неопределено Тогда
		Иначе
			НаименованиеПолноеПортал = СокрЛП(СведенияXML.ROW.VNAIMP);
			НаименованиеПортал = СокрЛП(СведенияXML.ROW.VNAIMK);
			ЮрАдресПортал = СокрЛП(СведенияXML.ROW.VPADRES);
			Если Лев(ЮрАдресПортал, 2) = ", " Тогда
				ЮрАдресПортал = Прав(ЮрАдресПортал, СтрДлина(ЮрАдресПортал) - 2);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	//проверка реквизитов на изменение, если изменились - задаем вопрос пользователю
	Если НаименованиеПолноеПортал <> Объект.НаименованиеПолное
		ИЛИ НаименованиеПортал <> Объект.Наименование Тогда
		
		ТекстВопроса = "Для УНП "+Объект.ИНН+" в государственном реестре плательщиков соответствует юридическое лицо со следующими реквизитами
		|
		| Наименование: " + НаименованиеПортал + "
		| Полное наименование: " + НаименованиеПолноеПортал + "
		| Юридический адрес: " + ЮрАдресПортал + "
		|
		|Установить данные реквизиты для текущего контрагента?";
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Наименование = НаименованиеПортал;
			Объект.НаименованиеПолное = НаименованиеПолноеПортал;
			
			ВидКИ_ЮрАдрес = ПолучитьВидКонтактнойИнформацииЮрАдрес();
			СтруктураОтбора = Новый Структура("Вид", ВидКИ_ЮрАдрес);
			МассивСтрок = Объект.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаКИ = Объект.КонтактнаяИнформация.Добавить();
				СтрокаКИ.Тип = ПолучитьТипКонтактнойИнформацииАдрес();
				СтрокаКИ.Вид = ВидКИ_ЮрАдрес;
				СтрокаКИ.Значение = ЮрАдресПортал;
			Иначе
				МассивСтрок[0].Значение = ЮрАдресПортал;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипКонтактнойИнформацииАдрес()

	Возврат Перечисления.ТипыКонтактнойИнформации.Адрес;

КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьВидКонтактнойИнформацииЮрАдрес()

	Возврат Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;

КонецФункции // ()


&НаКлиенте
Процедура ПроверитьЗаполнениеНовая(Команда)
	
	ПроверитьЗаполнениеНоваяНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ПроверитьЗаполнениеНоваяНаСервере()

	//1. Преобразование ДанныеФормыСтруктура -> СправочникОбъект.Контрагенты
	КонтрагентОбъект = РеквизитФормыВЗначение("Объект");
	
	//2. Вызов метода "Записать()" для объекта СправочникОбъект.Контрагенты
	РезультатПроверки = КонтрагентОбъект.ПроверитьЗаполнение();
	
	Если РезультатПроверки = Истина Тогда
		Сообщить("Ошибок не обнаружено!");	
	КонецЕсли; 
	
	//3. Преобразование СправочникОбъект.Контрагенты -> ДанныеФормыСтруктура  
	//ЗначениеВРеквизитФормы(КонтрагентОбъект, "Контрагент");

КонецПроцедуры // ПроверитьЗаполнениеНоваяНаСервере()

 
