
&НаСервере
Функция ПолучитьШаблонДоговораНаСервере()

	ДвоичныеДанные = Документы.ЗаказКлиента.ПолучитьМакет("ПФ_DOCX_ШаблонДоговора");
	
	АдресДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	Возврат АдресДанных;

КонецФункции // ПолучитьШаблонДоговораНаСервере()


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//1. Создание COM-объекта
	Word = Новый COMОбъект("Word.Application");
	
	АдресДанныхШаблона = ПолучитьШаблонДоговораНаСервере();
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанныхШаблона);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("docx");
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить шаблон договора. Обратитесь в службу поддержи!";
		Сообщение.Сообщить();	
		Возврат;
	КонецПопытки;
	
	//2. Создание нового документа на основе шаблона
	Документ = Word.Documents.Add(ИмяВременногоФайла);
	
	//3. Получение данных для заполнения
	ДанныеЗаполнения = ПолучитьДанныеЗаказа(ПараметрКоманды);
	
	//4. Заполнение документа
	Range = Документ.Content;
	
	Если Range.Find.Execute("$(Ответственный)$") Тогда
		Range.Text = ДанныеЗаполнения.Ответственный;
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(Телефон)$") Тогда
		Range.Text = "+ 7 (495) 1515611616";
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(Email)$") Тогда
		Range.Text = "info@test.ru";
	КонецЕсли;
	
	Range = Документ.Content;
	Если Range.Find.Execute("$(Номер)$") Тогда
		Range.Text = ДанныеЗаполнения.Номер;
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(Дата)$") Тогда
		Range.Text = ДанныеЗаполнения.Дата;
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(Дата)$") Тогда
		Range.Text = ДанныеЗаполнения.Дата;
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(Наименование организации)$") Тогда
		Range.Text = ДанныеЗаполнения.НаименованиеОрганизации;
	КонецЕсли;
	
	Range = Документ.Content;
	Если Range.Find.Execute("$(ИНН организации)$") Тогда
		Range.Text = ДанныеЗаполнения.ИНН;
	КонецЕсли;
	
	Range = Документ.Content;
	Если Range.Find.Execute("$(КПП организации)$") Тогда
		Range.Text = "";
	КонецЕсли;
	
	Range = Документ.Content;
	Если Range.Find.Execute("$(Юр. адрес организации)$") Тогда
		Range.Text = "г. Москва";
	КонецЕсли;
	
	Range = Документ.Content;
	Если Range.Find.Execute("$(E-mail организации)$") Тогда
		Range.Text = "info@roga.ru";
	КонецЕсли;
	
	Range = Документ.Content;
	Если Range.Find.Execute("$(Наименование контрагента)$") Тогда
		Range.Text = ДанныеЗаполнения.НаименованиеКонтрагента;
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(ИНН контрагента)$") Тогда
		Range.Text = ДанныеЗаполнения.ИННКонтрагента;
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(КПП контрагента)$") Тогда
		Range.Text = ДанныеЗаполнения.КППКонтрагента;
	КонецЕсли;

	Range = Документ.Content;
	Если Range.Find.Execute("$(Юр. адрес контрагента)$") Тогда
		Range.Text = "г. Ростов";
	КонецЕсли;

	МассивТоваров = ДанныеЗаполнения.Товары;
	
	Range = Документ.Range();
	Range.Find.Execute("#[ЯкорьТаблицы]#");
	Table = Range.Tables(1);
	СтрокаОбразец = Range.Rows(1);
	
	СуммаИтого = 0;
	Для каждого СтрокаТовара Из МассивТоваров Цикл
		
		НоваяСтрока = Table.Rows.Add(СтрокаОбразец);
		НоваяСтрока.Cells(1).Range.Text = СтрокаТовара.НомерСтроки;
		НоваяСтрока.Cells(2).Range.Text = СокрЛП(СтрокаТовара.Номенклатура);
		НоваяСтрока.Cells(3).Range.Text = СокрЛП(СтрокаТовара.ЕдИзм);
		НоваяСтрока.Cells(4).Range.Text = СтрокаТовара.Количество;
		НоваяСтрока.Cells(5).Range.Text = Формат(СтрокаТовара.Цена, "ЧДЦ=2; ЧРД=.; ЧГ=3,0");
		НоваяСтрока.Cells(6).Range.Text = Формат(СтрокаТовара.Сумма, "ЧДЦ=2; ЧРД=.; ЧГ=3,0");
		
		СуммаИтого = СуммаИтого + СтрокаТовара.Сумма;
		
	КонецЦикла; 
	
	Range = Документ.Content;
	Если Range.Find.Execute("$(СуммаИтого)$") Тогда
		Range.Text = Формат(СуммаИтого,"ЧДЦ=2; ЧРД=.; ЧГ=3,0");
	КонецЕсли;
	
	СтрокаОбразец.Delete();
	
	//5. Показать документ пользователю
	Word.Visible = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаказа(СсылкаНаДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ответственный КАК Ответственный,
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
		|	ЗаказКлиента.Организация.ИНН КАК ИНН,
		|	ЗаказКлиента.Контрагент.НаименованиеПолное КАК НаименованиеКонтрагента,
		|	ЗаказКлиента.Контрагент.ИНН КАК ИННКонтрагента,
		|	ЗаказКлиента.Контрагент.КПП КАК КППКонтрагента,
		|	ЗаказКлиента.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		ЕдиницаИзмерения КАК ЕдИзм,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК Товары
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	ДанныеДокумента = Новый Структура;
	
	Для каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		
		Если КолонкаРезультата.Имя = "Товары" Тогда
			Продолжить;
		КонецЕсли; 
		ДанныеДокумента.Вставить(КолонкаРезультата.Имя, "");	
		
	КонецЦикла; 
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Выборка);
	
	МассивТоваров = Новый Массив;
	ВыборкаТовары = Выборка.Товары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		
		СтруктураТовара = Новый Структура;
		
		Для каждого Колонка Из Выборка.Товары.Колонки Цикл
			СтруктураТовара.Вставить(Колонка.Имя, ВыборкаТовары[Колонка.Имя]);			
		КонецЦикла; 
		
		МассивТоваров.Добавить(СтруктураТовара);
		
	КонецЦикла; 
	
	ДанныеДокумента.Вставить("Товары", МассивТоваров);
	
	Возврат ДанныеДокумента;
	
КонецФункции // ()
