
&НаКлиенте
Процедура НазначитьОсновным(Команда)

	//1. получить ссылку на текущий	(выделенный) в списке договор
	Договор = Элементы.Список.ТекущаяСтрока;
	
	//передача данных на сервер
	НазначитьОсновнойДоговор(Договор);
	
	//5. Оповщение списков об изменении
	ИзмененыОбъектыТипа = Тип("СправочникСсылка.ДоговорыКонтрагентов");
	ОповеститьОбИзменении(ИзмененыОбъектыТипа);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НазначитьОсновнойДоговор(Договор)

	//2. Определить владельца договора (контрагента)
	Контрагент = Договор.Владелец;
	
	//3. Выбрать все договоры контрагента и для договора с флагом "Основной" изменить значение на "Ложь"
	Выборка = Справочники.ДоговорыКонтрагентов.Выбрать(, Контрагент);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Основной Тогда
			ДоговорОбъект = Выборка.ПолучитьОбъект();
			ДоговорОбъект.Основной = Ложь;
			ДоговорОбъект.Записать();
		КонецЕсли; 	
	КонецЦикла; 
	
	//4. Для выбранного договора установить значение реквизита "Основной" в "Истина"
	ВыбранныйДоговорОбъект = Договор.ПолучитьОбъект();
	ВыбранныйДоговорОбъект.Основной = Истина;
	ВыбранныйДоговорОбъект.Записать();

КонецПроцедуры
