
Функция ДобавитьКДатеКалендарныеДни(ИсходнаяДата, КоличествоДней) Экспорт
	
	Результат = Неопределено;
	Счетчик = 0;
	ВыборкаКалендарь = РегистрыСведений.ПроизводственныйКалендарь.Выбрать();
	Пока ВыборкаКалендарь.Следующий() Цикл
		
		Если ВыборкаКалендарь.Дата <= ИсходнаяДата Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ВыборкаКалендарь.ВидДня = Перечисления.ВидыДнейКалендаря.Рабочий Тогда
			Счетчик = Счетчик + 1;	
		КонецЕсли; 
		
		Если Счетчик = КоличествоДней Тогда
			Результат = ВыборкаКалендарь.Дата;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Результат;

КонецФункции

Функция КоличествоЭлементов(ИмяСправочника) Экспорт
	
	//проверка наличия справочника в конфигурации
	РезультатПоиска = Метаданные.Справочники.Найти(ИмяСправочника);
	
	Если РезультатПоиска <> Неопределено Тогда
		
		Количество = 0;
		Выборка = Справочники[ИмяСправочника].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПометкаУдаления = Ложь Тогда
				Количество = Количество + 1;
			КонецЕсли; 	
		КонецЦикла; 
		
	Иначе
		Количество = Неопределено;	
	КонецЕсли; 
	
		
	Возврат Количество;

КонецФункции

Функция ПолучитьУчетнуюПолитикуОрганизации(Дата, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаСрезПоследних.МетодРасчета КАК МетодРасчета
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Дата, Организация = &Организация) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		МетодРасчета = Выборка.МетодРасчета;

	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для организации " + Организация + " не установлена учетная политика";
		Сообщение.Сообщить();
		
		МетодРасчета = Неопределено;
		
	КонецЕсли;   
	
	Возврат МетодРасчета;

КонецФункции