
Функция ДобавитьКДатеКалендарныеДни(ИсходнаяДата, КоличествоДней) Экспорт
	
	Результат = Неопределено;
	Счетчик = 0;
	ВыборкаКалендарь = РегистрыСведений.ПроизводственныйКалендарь.Выбрать();
	Пока ВыборкаКалендарь.Следующий() Цикл
		
		Если ВыборкаКалендарь.Дата <= ИсходнаяДата Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ВыборкаКалендарь.ВидДня = Перечисления.ВидыДнейКалендаря.Рабочий Тогда
			Счетчик = Счетчик + 1;	
		КонецЕсли; 
		
		Если Счетчик = КоличествоДней Тогда
			Результат = ВыборкаКалендарь.Дата;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Результат;

КонецФункции

Функция КоличествоЭлементов(ИмяСправочника) Экспорт
	
	//проверка наличия справочника в конфигурации
	РезультатПоиска = Метаданные.Справочники.Найти(ИмяСправочника);
	
	Если РезультатПоиска <> Неопределено Тогда
		
		Количество = 0;
		Выборка = Справочники[ИмяСправочника].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПометкаУдаления = Ложь Тогда
				Количество = Количество + 1;
			КонецЕсли; 	
		КонецЦикла; 
		
	Иначе
		Количество = Неопределено;	
	КонецЕсли; 
	
		
	Возврат Количество;

КонецФункции