
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособЧтения = "МетодОбъекта";
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиТовар(Команда)
	
	Если СпособЧтения = "МетодОбъекта" Тогда
		Номенклатура = НайтиТовар_МетодОбъекта(Артикул);
	Иначе
		Номенклатура = НайтиТовар_Запрос(Артикул);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиТовар_МетодОбъекта(Артикул)
	
	НайденныйТовар = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
	
	Возврат НайденныйТовар; 
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиТовар_Запрос(Артикул)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
	
	КонецЕсли; 
	
	Возврат Номенклатура;
	
			
КонецФункции
