
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	//1. контрагент, который выделен в списке
	ТекКонтрагент = Элементы.Список.ТекущаяСтрока;
	
	//2. Получить данные контактной информациии для контрагента
	ДанныеСтруктура = ПолучитьКонтактыКонтрагента(ТекКонтрагент);
	
	//3. Заполнение реквизитов формы
	ЮрАдрес = ДанныеСтруктура.ЮрАдрес;
	ФактАдрес = ДанныеСтруктура.ФактАдрес;
	Телефон = ДанныеСтруктура.Телефон;
	Email = ДанныеСтруктура.Email;
	
	//4. добавление строк в таблицу значений
	Контакты.Очистить();
	ДобавитьСтрокуКонтактов("Юридический адрес", ЮрАдрес);
	ДобавитьСтрокуКонтактов("Фактический адрес", ФактАдрес);
	ДобавитьСтрокуКонтактов("Телефон", Телефон);
	ДобавитьСтрокуКонтактов("Email", Email);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуКонтактов(Вид, Значение)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли; 
	
	СтрокаТаблицы = Контакты.Добавить();
	СтрокаТаблицы.Вид = Вид;
	СтрокаТаблицы.Значение = Значение;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьКонтактыКонтрагента(Контрагент)

	//создаем контейнер для хранения данных
	ДанныеСтруктура = Новый Структура("ЮрАдрес, ФактАдрес, Телефон, Email");
	
	//получаем данные объекта по ссылке
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	
	//обходим табличную часть
	Для каждого СтрокаТЧ Из КонтрагентОбъект.КонтактнаяИнформация Цикл
		
		Если СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента Тогда
			ДанныеСтруктура.ЮрАдрес = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента Тогда
			ДанныеСтруктура.ФактАдрес = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			ДанныеСтруктура.Телефон = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента Тогда
			ДанныеСтруктура.Email = СтрокаТЧ.Значение;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат ДанныеСтруктура;
	
КонецФункции // ПолучитьКонтактыКонтрагента()


&НаКлиенте
Процедура СкопироватьЗначение(Команда)
	
	
	
КонецПроцедуры

