
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	СтруктураКонтактнойИнформации = ПолучитьКонтактыКонтрагента(ТекСтрока);
	ЮрАдрес		= СтруктураКонтактнойИнформации.ЮрАдрес;
	ФактАдрес	= СтруктураКонтактнойИнформации.ФактАдрес;
	Телефон		= СтруктураКонтактнойИнформации.Телефон;
	Email		= СтруктураКонтактнойИнформации.Email;
	
КонецПроцедуры                                                 

&НаСервереБезКонтекста
Функция ПолучитьКонтактыКонтрагента(Контрагент)
	
	СтруктураДанных = Новый Структура("ЮрАдрес, ФактАдрес, Телефон, Email");
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();                         
	ВидКИ_ЮрАдрес	= Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ВидКИ_ФактАдрес	= Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ВидКИ_Email		= Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	ВидКИ_Телефон	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	
	Для каждого СтрокаТЧ Из КонтрагентОбъект.КонтактнаяИнформация Цикл
		Если СтрокаТЧ.Вид = ВидКИ_ЮрАдрес Тогда
			СтруктураДанных.ЮрАдрес = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = ВидКИ_ФактАдрес Тогда    
			СтруктураДанных.ФактАдрес = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = ВидКИ_Телефон Тогда    
			СтруктураДанных.Телефон = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = ВидКИ_Email Тогда    
			СтруктураДанных.Email = СтрокаТЧ.Значение;
		КонецЕсли;		
	
	КонецЦикла;
	
	Возврат СтруктураДанных;

КонецФункции // ПолучитьКонтактыКонтрагента()

