
&НаКлиенте
Процедура ОбратитьсяКЗначению(Команда)
	ОбратитьсяКЗначениюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбратитьсяКЗначениюНаСервере()
	
	СтароеЗначение = Константы.СистемаНалогооблажения.Получить();
	Если СтароеЗначение = Перечисления.СистемаНалогооблажения.Общая Тогда
		Сообщить("Изменять систему налогообложенния нельзя!");
		Возврат;
	КонецЕсли; 
	
	НовоеЗначение = Перечисления.СистемаНалогооблажения.Упрощенная;
	Константы.СистемаНалогооблажения.Установить(НовоеЗначение);
	
КонецПроцедуры
