
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//1. Создать новый табличный документ
	ТабДок = Новый ТабличныйДокумент;
	
	//2. Заполнить табличный документ, используя области из макета:
	ОбработкаКомандыНаСервере(ПараметрКоманды, ТабДок);
	
	//3. Настроить свойства табличного документа (ориентация страницы, отступы и т.д.)
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	//4. Показать печатную форму пользователя
	//ТабДок.Показать();
	СтруктураПараметров = Новый Структура("ТабДок", ТабДок);
	ОткрытьФорму("Обработка.ПечатьДокументов.Форма.Форма", СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыНаСервере(МассивДокументов, ТабДок)

	Документы.ЗаказКлиента.ПечатьСчетаНаОплату(ТабДок, МассивДокументов); 
		
КонецПроцедуры // ОбработкаКомандыНаСервере()

