
#Область Задача1

&НаКлиенте
Процедура ОткрытьФормуВыбораНоменклатуры(Команда)
	
	// 1. Открыть основную форму выбора справочника "Номенклатура"
	
КонецПроцедуры

#КонецОбласти

#Область Задача2

&НаКлиенте
Процедура ОткрытьФормуСпискаНоменклатурыСОтбором(Команда)
	
	//2. Открыть форму списка справочника "Номенклатуры" с отбором по виду номенклатуры "Роботы-пылесосы"
	
КонецПроцедуры

#КонецОбласти

#Область Задача3

&НаКлиенте
Процедура ПоказатьВыборКонтрагента(Команда)
	
	//3. Показать форму выбора справочника "Контрагенты".
	//Выбранного пользователем контрагента нужно записать в реквизит формы "Контрагент"
	
//	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтотОбъект),,, Тип("СправочникСсылка.Контрагенты"));
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтрагента(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	

КонецПроцедуры // ()


#КонецОбласти

#Область Задача4

&НаКлиенте
Процедура ПоказатьВыборНоменклатуры(Команда)
	
	//4. Показать форму выбора справочника "Номенклатура".
	//Выбранную пользователем номенклатуру нужно записать в реквизит формы "Контрагент"
	
КонецПроцедуры

#КонецОбласти

#Область Задача5

&НаКлиенте
Процедура ЗапроситьКоличество(Команда)
	
	//5. Запросить у пользователя ввод количества номенклатуры
	//Введенное пользователем количество нужно записать в реквизит формы "Количество"
	
КонецПроцедуры

#КонецОбласти

#Область Задача6

&НаКлиенте
Процедура ЗапроситьЦену(Команда)
	
	//6. Запросить у пользователя ввод цены номенклатуры
	//Введенную пользователем цену нужно записать в реквизит формы "Цена".
	//Также нужно рассчитать значение реквизита формы "Сумма" по формуле:
	//Сумма = Количество*Цена

КонецПроцедуры

#КонецОбласти

#Область Задача7

&НаКлиенте
Процедура ПоказатьВопросССуммой(Команда)
	
	//7. Показать пользователю вопрос, текст вопроса должен быть следующим:
	//"Общая сумма заказа составляет [Сумма] ([СуммаПрописью]) рублей. Оформить заказ?"
	//[Сумма] - значение реквизита формы "Сумма"
	//[СуммаПрописью] - сумма прописью (например, "пятьдесят шесть")
	//Кнопки в окне вопроса - "Да", "Нет"
	//Если пользователь отвечает "Да" - показать предупреждение с текстом "Заказ успешно оформлен".
	//При ответе "Нет" - ничего делать не нужно
	
КонецПроцедуры

#КонецОбласти