
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("СуммаВсего");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//применение № 1 - начальное заполнение объекта
	Склад = Константы.ОсновнойСклад.Получить();
	//вариант 2
	Склад = ОбщегоНазначенияПовтИсп.ПолучитьОсновнойСклад();
	
	//применение № 2 - заполнение объекта на основании другого объекта (ДанныеЗаполнения)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = ДанныеЗаполнения;
	//применение № 3 - заполнение объекта на основании другого объекта (метод Заполнить)	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		
		СтрокаТЧ = Товары.Добавить();
		СтрокаТЧ.Номенклатура = ДанныеЗаполнения.Номенклатура;
		СтрокаТЧ.Количество = 1;
		
	КонецЕсли; 
	
КонецПроцедуры
