
&НаКлиенте
Процедура Вопрос1(Команда)
	ЧислоА = Ложь;
	ЧислоБ = 2;
	ЧислоВ = 3;
	ЧислоГ = ЧислоА = ЧислоБ = ЧислоВ;
	Сообщить(ЧислоГ);
КонецПроцедуры


&НаКлиенте
Процедура УбратьЦифрыИзСтроки(Команда)
	
	ИсходнаяСтрока = "  Это  стро4ка с 8 цифрами 7"; 
	
	Сообщить(УдалитьЦифры(ИсходнаяСтрока));
	Сообщить(ИсходнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Функция УдалитьЦифры(ИсходнаяСтрока)
	
	ЛокальнаяСтрока = ИсходнаяСтрока;
	СтрокаЦифр = "0123456789"; 
	
	Для НомерСимвола=1 По 10 Цикл
		
		ТекСимвол = Сред(СтрокаЦифр, НомерСимвола, 1);//"0"
		РезультатПоиска = СтрНайти(ИсходнаяСтрока, ТекСимвол); 
		Если РезультатПоиска > 0 Тогда
			ЛокальнаяСтрока = СтрЗаменить(ЛокальнаяСтрока, ТекСимвол, "");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЛокальнаяСтрока;  
	
КонецФункции


&НаКлиенте
Процедура Вопрос3(Команда)
	
	//1. ЗАПОЛНЕНИЕ МАССИВА
	МассивДат = Новый Массив;
	ТекДата = '20210901';
	ТекЗначение = НачалоМесяца ( '20210901' );
	КонМесяца = КонецМесяца ( '20210930' );
	
	Пока ТекЗначение <= КонМесяца Цикл
		НомерДня = ДеньНедели ( ТекЗначение );
		//Если НомерДня < 6 Тогда
			МассивДат.Добавить(ТекЗначение);
		//	Сообщить(ТекДатаФормат);
		//КонецЕсли; 
		ТекЗначение = ТекЗначение + 86400;
	КонецЦикла;   
	
	//2. УДАЛЕНИЕ ЭЛЕМЕНТОВ МАССИВА

	//получить индекс последнего элемента
	Индекс = МассивДат.ВГраница();
	
	//цикл по условию пока индекс не равен 0
	Пока Индекс >= 0 Цикл
		
		//получаем из массива дат значение по индексу
		ТекДата = МассивДат[Индекс];  
		
		//определяем номер дня недели
		НомерДняНедели = ДеньНедели(ТекДата); 
		
		//проверяем условие
		Если НомерДняНедели > 5 Тогда
			//удаляем элемент массива по индексу
			МассивДат.Удалить(Индекс);
		КонецЕсли;                              
		
		//уменьшаем индекс на 1 (переход к предыдущему элементу массива)		
		Индекс = Индекс - 1;
		
	КонецЦикла;      
	
КонецПроцедуры

&НаКлиенте
Процедура Вопрос4(Команда)

	СтрокаСПробелами = "   красный   синий   желтый  зеленый  ";
	
	Массив = СтрРазделить(СтрокаСПробелами, " ", Ложь);
	
	КоличествоСлов = Массив.Количество();
	
КонецПроцедуры


