Перем ВалютаУчета;
Перем СтатьяРасходов;

Процедура НоваяПроцедура()
	А = 1;
	Б = 2;  
	ВалютаУчета = 45;
КонецПроцедуры

Процедура ПеременныеИТипыДанных()
	
	Сообщить(ВалютаУчета);
	
	КодВалюты = "799";//тип - Строка
	Фамилия = "Иванов";
	КодВалюты = 5;//тип - Число
	ВалютаУчета = "USD";          
	
	ЧислоА = 123;
	ЧислоБ = 256;
	
	//сумма чисел ЧислоА и ЧислоБ
	//результат поместить в ЧислоВ
	//ЧислоВ = ЧислоА + ЧислоБ;
	ЧислоВ = ЧислоА*ЧислоБ;
	
	//ПРИМИТИВНЫЕ ТИПЫ ДАННЫХ
	//ЧИСЛО
	ПростоеЧисло = 15;
	ДробноеЧисло = 4.25;
	
	//ДелениеНаНоль = ПростоеЧисло/0;
	
	//СТРОКА
	ПростаяСтрока = "Hello, World";
	МногострочнаяСтрока = "Первая строка
	|Вторая строка";
	
	ПервоеСлово = "Привет";
	ВтороеСлово = "мир";
	Предложение = ПервоеСлово + ", " + ВтороеСлово + "!";//конкатенация
	
	//ООО "Рога и Копыта"
	НазваниеОрганизации = "ООО ""Рога и Копыта"""; 
	
	Сообщить(Предложение); 
	
	//ДАТА
	ТекДата = '20210909';//ГГГГММДДччммсс 
	ЗавтрашнийДень = ТекДата + 60*60*24;//86400
	ВчерашнийДень = ТекДата - 86400;
	
	НачалоМесяца = '20210901';
	ТретьеСентября = '20210903';
	РазницаВСекундах = ТретьеСентября - НачалоМесяца;
	
	Сообщить(ЗавтрашнийДень);      
	Сообщить(ВчерашнийДень);
	Сообщить("Разница дат составляет " + РазницаВСекундах/86400 + " дней");
	
	//БУЛЕВО
	СегодняРабочийДень = Истина;
	СегодняВыходной = Ложь;
	
	ОбратноеЗначение = НЕ СегодняВыходной; 
	
	//НЕОПРЕДЕЛЕНО
	ПустоеЗначениеНеизвестногоТипаВоВстроенномЯзыке = Неопределено; 
	
	//NULL
	ПустоеЗначениеНеизвестногоТипаНаУровнеБазыДанных = NULL; 
	
	//Тип
	ТипЧисло = Тип("Число");
	
	Если ТипЗнч(НачалоМесяца) = ТипЧисло Тогда
		//какое-то действие
	КонецЕсли;

КонецПроцедуры

Процедура УсловныйОператор()
	
	Количество = 74;
	Сумма = 150;
	Количество = Количество - 74;
	Цена = Неопределено;
	
	
	////////////////////////////////////
	//УСЛОВНЫЙ ОПЕРАТОР
	
	//ВАРИАНТ № 1 (только ветка Если...)
	Если Количество <> 0 Тогда
		Цена = Сумма / Количество;
	КонецЕсли;
	
	//ВАРИАНТ № 2 (ветка Если...Иначе...)
	Если Количество <> 0 Тогда
		Цена = Сумма / Количество;
	Иначе
		Сообщить("Деление на ноль!");
	КонецЕсли;	
	//Сообщить(Цена);
	
	//ВАРИАНТ № 3 (веткт Если...ИначеЕсли...Иначе)
	НомерМесяца = 7;
	Если НомерМесяца = 1 Тогда
		МесяцСтрокой = "январь";
	ИначеЕсли НомерМесяца = 2 Тогда
		МесяцСтрокой = "февраль";
	ИначеЕсли НомерМесяца = 3 Тогда
		МесяцСтрокой = "март";
	ИначеЕсли НомерМесяца = 4 Тогда
		МесяцСтрокой = "апрель";
	ИначеЕсли НомерМесяца = 5 Тогда
		МесяцСтрокой = "май";
	ИначеЕсли НомерМесяца = 6 Тогда
		МесяцСтрокой = "июнь";
	ИначеЕсли НомерМесяца = 7 Тогда
		МесяцСтрокой = "июль";
	ИначеЕсли НомерМесяца = 8 Тогда
		МесяцСтрокой = "август";
	ИначеЕсли НомерМесяца = 9 Тогда
		МесяцСтрокой = "сентябрь";
	ИначеЕсли НомерМесяца = 10 Тогда
		МесяцСтрокой = "октябрь";
	ИначеЕсли НомерМесяца = 11 Тогда
		МесяцСтрокой = "ноябрь";
	ИначеЕсли НомерМесяца = 12 Тогда
		МесяцСтрокой = "декабрь";
	Иначе
		Сообщить("Неверный номер месяца!");
	КонецЕсли;	
	Сообщить(МесяцСтрокой);
	
	Дата1 = '20210901';
	Дата2 = '20210903';
	РазницаВДнях = (Дата2 - Дата1)/86400 + 1;
	Если РазницаВДнях > 5 Тогда
		Сообщить("Между датами больше 5-ти дней!");
	Иначе
		Сообщить("Между датами меньше либо равно 5 дней!");	
	КонецЕсли;
	
	//Разница по модулю
	Число1 = 7;
	Число2 = 13;
	//|А-Б| = 
	Если Число1 > Число2 Тогда
		МодульРазницы = Число1 - Число2;
	Иначе                               
		МодульРазницы = Число2 - Число1;
	КонецЕсли;
	Сообщить(МодульРазницы);   
	
	//краткая форма
	МодульРазницы = ?(Число1 > Число2, Число1 - Число2, Число2 - Число1); 
	
	
	Строка1 = "красный";
	Число2 = 15;
	//ошибка - нельзя сравнивать на < и > несовпадающие типы
	//Если Строка1 > Число2 Тогда
	//	Сообщить("Строка больше числа");
	//КонецЕсли;
	
	Количество = 15;
	Сумма = 250;
	
	Количество = Количество - 15;
	Сумма = Сумма - 250;
	
	Цена = 0;
	Если Количество <> 0 ИЛИ Сумма <> 0 Тогда
		Цена = Сумма/Количество;
	КонецЕсли;
	
	Условие1 = Истина;
	Условие2 = Ложь;
	Условие3 = Истина;
	Условие4 = Ложь;
	Условие5 = Ложь;
	Условие6 = Истина;
	
	СложноеУсловие = Условие1 И (Условие2 ИЛИ Условие3) ИЛИ Условие4 И Условие5 И НЕ Условие6;
	Сообщить(СложноеУсловие);

КонецПроцедуры

Процедура Циклы()
	//ЦИКЛЫ
	
	ДатаНачала = '20210901';
	ДатаОкончания = '20210930';
	
	Пока ДатаНачала <= ДатаОкончания Цикл
		Сообщить(ДатаНачала);
		ДатаНачала = ДатаНачала + 86400;
	КонецЦикла;
	
	//1. ЦИКЛ ПО УСЛОВИЮ
	СуммаЧисел = 0;
	X = 1;
	Пока X <= 100 Цикл
		СуммаЧисел = СуммаЧисел + X;
		X = X + 1;	
	КонецЦикла;
	Сообщить(СуммаЧисел);  
	
	//2. ЦИКЛ ПО СЧЕТЧИКУ
	СуммаЧисел = 0;
	Для ТекЧисло=1 По 100 Цикл
		СуммаЧисел = СуммаЧисел + ТекЧисло;
	КонецЦикла; 
	Сообщить(СуммаЧисел); 
	
	//3. Цикл по коллекции
	МассивЧисел = Новый Массив;
	//цикл заполнения коллекции (массива)
	Для Число=1 По 100 Цикл
		МассивЧисел.Добавить(Число);
	КонецЦикла;       
	
	//цикл просмотра элементов коллекции
	СуммаЧисел = 0;
	Для каждого ТекЭлемент Из МассивЧисел Цикл
		СуммаЧисел = СуммаЧисел + ТекЭлемент;
	КонецЦикла;
	Сообщить(СуммаЧисел);
	
	//Сумма четных чисел
	СуммаЧетныхЧисел = 0;
	Для ТекЧисло = 1 По 100 Цикл
		
		Если ТекЧисло%2 <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаЧетныхЧисел = СуммаЧетныхЧисел + ТекЧисло;
		
	КонецЦикла;
	Сообщить(СуммаЧетныхЧисел);   
	
	//суммирование до достижения 1000
	СуммаЧисел = 0;
	Для ТекЧисло = 1 По 100 Цикл
		
		Если СуммаЧисел >= 1000 Тогда
			Прервать;
		КонецЕсли;
		
		СуммаЧисел = СуммаЧисел + ТекЧисло;
		
	КонецЦикла;   
	Сообщить(СуммаЧисел);   
	
КонецПроцедуры

Процедура ПреобразованиеТипов()
	
	//ПРЕОБРАЗОВАНИЕ ТИПОВ
	ЧислоПлюсСтрока = 2 + "2";//4
	Сообщить(ЧислоПлюсСтрока);
	
	СтрокаПлюсЧисло = "2" + 2;//"22"
	Сообщить(СтрокаПлюсЧисло);
	
	//ЧислоПлюсБуква = 2 + "А";//ошибка 
	//Сообщить(ЧислоПлюсБуква);
	
	ДатаПлюсЧисло = '20210909' + 15;//'09.09.2021 00:00:15'
	Сообщить(ДатаПлюсЧисло);
	
	ПервоеЧисло = 5;
	ВтороеЧисло = 7;
	Сумма = ПервоеЧисло + ВтороеЧисло;
	
	ТекстСообщения = "" + ПервоеЧисло + " + " + ВтороеЧисло + " = " + Сумма; //"5 + 7 = 12"
	Сообщить(ТекстСообщения);
	
	//ЧислоПлюсДата = 5 + '20210909';
	//Сообщить(ЧислоПлюсДата);
	
	ЧислоПлюсИстина = 5 + Истина;
	Сообщить(ЧислоПлюсИстина);
	
	//Возврат;
	
КонецПроцедуры

Процедура ОпределитьТипФайла()
	
	Расширение = "dat";
	
	Если Расширение = "dat" Тогда
		Сообщить("Неизвестный формат");
		Возврат;
	КонецЕсли;
	
	Если Расширение = "jpg" ИЛИ Расширение = "png" ИЛИ Расширение = "bmp" Тогда
		ТипФайла = "Картинка";
	ИначеЕсли Расширение = "xls" ИЛИ Расширение = "xlsx" Тогда
		ТипФайла = "Excel-таблица";
	ИначеЕсли Расширение = "txt" ИЛИ Расширение = "csv" Тогда
		ТипФайла = "Текстовый документ";
	Иначе
		ТипФайла = "Неопределено";
	КонецЕсли;
	
	Сообщить(ТипФайла);
	
КонецПроцедуры

Функция ПолучитьСуммуЧисел(ЧислоА, ЧислоБ, ЧислоВ=0)
	
	Сумма = ЧислоА + ЧислоБ + ЧислоВ;
	
	Возврат Сумма;
	
КонецФункции

Функция ПолучитьРазностьЧисел()
	
	Перем Число1;
	Перем Число2;
	
	Число1 = 25;
	Число2 = 11;
	
	Если Число1 > Число2 Тогда
		Разность = Число1 - Число2;
	Иначе
		Разность = Число2 - Число1;
	КонецЕсли;
	
	Возврат Разность;	

КонецФункции

Функция ИзменитьСтроку(ИсходнаяСтрока)

	ИсходнаяСтрока = ИсходнаяСтрока + "; " + ИсходнаяСтрока; 
	
	Возврат ИсходнаяСтрока;
	
КонецФункции

Процедура ИзменитьНаПроцент(Сумма, Процент)
	Сумма = Сумма + Сумма*Процент/100;	
КонецПроцедуры

Процедура ВстроенныеФункции_Число()

	ДробноеЧисло = 1200.25;
	ЦелаяЧасть = Цел(ДробноеЧисло);//12
	
	ОкруглениеВариант1 = Окр(ДробноеЧисло);//12
	ОкруглениеВариант2 = Окр(ДробноеЧисло, 1);//12.3
	ОкруглениеВариант3 = Окр(ДробноеЧисло, 1, 0);//12.2
	
	ДробноеЧислоФормат = Формат(ДробноеЧисло, "ЧЦ=10; ЧДЦ=2; ЧРД=.; ЧГ=0"); 
	
	ТекстСообщения = "ИсходноеЧисло: " + ДробноеЧислоФормат + "
						|Округление (вар. 1): " + ОкруглениеВариант1 + "
						|Округление (вар. 2): " + ОкруглениеВариант2 + "
						|Округление (вар. 3): " + ОкруглениеВариант3;
	
	
	ПараметрыПредметаИсчисления = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	ДробноеЧислоПрописью = ЧислоПрописью(ДробноеЧисло,"ДП=Истина",ПараметрыПредметаИсчисления);
	Сообщить(ТекстСообщения);
	Сообщить(ДробноеЧислоПрописью)
	
КонецПроцедуры

Процедура ВстроенныеФункции_Строка()
	
	ТестоваяСтрока = "  красный, синий, желтый,    ";
	КоличествоСимволов = СтрДлина(ТестоваяСтрока);//29
	
	БезПробеловСлева = СокрЛ(ТестоваяСтрока);//"красный, синий, желтый,   " 
	БезПробеловСправа = СокрП(ТестоваяСтрока);//"  красный, синий, желтый,"
	БезПробеловСлеваИСправа = СокрЛП(ТестоваяСтрока);//"красный, синий, желтый,"
	
	СловоКрасный = Лев(ТестоваяСтрока, 9);//"  красный"
	СловоЖелтый = Прав(ТестоваяСтрока, 11);//"желтый,    "
	СловоСиний = Сред(ТестоваяСтрока, 12, 5);//"синий"

	ПозицияЗапятой = СтрНайти(ТестоваяСтрока, ",");//10
	ПозицияПоследнейЗапятой = СтрНайти(ТестоваяСтрока, ",", НаправлениеПоиска.СКонца);

	СтрокаВВерхнемРегистре = ВРег(ТестоваяСтрока);//"  КРАСНЫЙ, СИНИЙ, ЖЕЛТЫЙ,    "
	СтрокаВНижнемРегистре = ВРег(ТестоваяСтрока);//"  красный, синий, желтый,    "
	
	Адрес = "Республика Беларусь, г. Минск, ул. Казинца 11А";

	РезультатПоиска = СтрНайти(НРег(Адрес), "минск");
	
	Если СтрНайти(ТестоваяСтрока, ",") > 0 Тогда
		//нашли
	Иначе
		//не нашли
	КонецЕсли;

	НоваяСтрока = "          ";
	Если ПустаяСтрока(НоваяСтрока) = Истина Тогда
		Сообщить("Строка пустая");
	Иначе                         
		Сообщить("Строка не пустая");
	КонецЕсли; 
	
	Если НоваяСтрока = "" Тогда
	КонецЕсли;    
	
	ТестоваяСтрокаПослеЗамены = СтрЗаменить(ТестоваяСтрока, ",", ";");
	Сообщить(ТестоваяСтрокаПослеЗамены);    
	
	МногострочнаяСтрока = "синий
							|красный
							|желтый
							|зеленый";
	
	КоличествоСтрок = СтрЧислоСтрок(МногострочнаяСтрока);
	ВтораяСтрока = СтрПолучитьСтроку(МногострочнаяСтрока, 2);
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		ТекущаяСтрока = СтрПолучитьСтроку(МногострочнаяСтрока,НомерСтроки);
		Сообщить(ТекущаяСтрока);
	КонецЦикла;
	

КонецПроцедуры

Процедура ВстроенныеФункции_Дата()

	ТекДата = ТекущаяДата();
	
	ТекГод = Год(ТекДата);//2021
	ТекМесяц = Месяц(ТекДата);//9
	
	НачМесяца = НачалоМесяца(ТекДата);
	
	КонМесяца = КонецМесяца(ТекДата);
	
	Пока НачМесяца <= КонМесяца Цикл
		Сообщить(НачМесяца);
		НачМесяца = НачМесяца + 86400;
	КонецЦикла;    
	
	ДатаЗавтра = ТекущаяДата() + 86400;
	ДеньНеделиЗавтра = ДеньНедели(ДатаЗавтра);
	Сообщить(ДеньНеделиЗавтра);
	
	КонецГода = КонецГода(ТекущаяДата());
	ДеньПоследнегоДня = ДеньГода(КонецГода);//365 или 366
	Если ДеньПоследнегоДня = 366 Тогда
		Сообщить("Високосный");
	Иначе                      
		Сообщить("НЕ Високосный");
	КонецЕсли;
	
	ТекДатаФормат = Формат(ТекДата, "ДФ='dd MMMM yyyy ""г. ""(dddd)'"); 
	
	Сообщить(ТекДатаФормат);
	
КонецПроцедуры

//Строка = "раз два три    ";
//Слова = СтрРазделить(СокрЛП(Строка), " ");

//Должность = "директор";
//ДолжностьРезультат = РаботаСоСтроками.Просклонять(Должность, "Родительный");
//Сообщить(ДолжностьРезультат[0]);

//ВстроенныеФункции_Число();

//ВстроенныеФункции_Строка(); 

//ВстроенныеФункции_Дата();

//ИсходнаяСумма = 1500;
//ИзменитьНаПроцент(ИсходнаяСумма, 30);
//Сообщить(ИсходнаяСумма);

//ФактическийПараметр = "красный";
//Результат = ИзменитьСтроку(ФактическийПараметр);
//Сообщить(Результат);//красный;красный
//Сообщить(ФактическийПараметр);//красный

//ЧислоА = 21;
//ЧислоБ = 4;

//СуммаЧисел = ПолучитьСуммуЧисел(ЧислоА,ЧислоБ);
//Сообщить(СуммаЧисел);

//СуммаЧисел = ПолучитьСуммуЧисел(25,45);
//Сообщить(СуммаЧисел);

//СуммаЧисел = ПолучитьСуммуЧисел(7, 19);
//Сообщить(СуммаЧисел);

//СуммаЧисел = ПолучитьСуммуЧисел(27, 49);
//Сообщить(СуммаЧисел);

//СуммаТрехЧисел = ПолучитьСуммуЧисел(119, 118, 254);
//Сообщить(СуммаТрехЧисел);

//НоваяПроцедура();
//ПреобразованиеТипов();

//УсловныйОператор();
//ПеременныеИТипыДанных();
//УсловныйОператор();
//УсловныйОператор();     

//вызов процедуры
//ОпределитьТипФайла();   

////вызов функции
//СуммаЧисел = ПолучитьСуммуЧисел();

//Если СуммаЧисел = Неопределено Тогда
//	Сообщить("НЕ удалось выполнить расчет...");
//КонецЕсли;

//Сообщить(СуммаЧисел);

//Сообщить("Строка сообщения", СтатусСообщения.Важное);

Функция ПолучитьСуммуСтрокой(ИсходноеЧисло)
	
	Рубли = Цел(ИсходноеЧисло);//45
	Копейки = (ИсходноеЧисло - Рубли)*100;//17
	СуммаСтрокой = "" + Рубли + " руб. " + Копейки + " коп.";
	
	Возврат СуммаСтрокой;
	
КонецФункции

Функция ПолучитьПроизведениеЧисел(ЧислоА, ЧислоБ)
	
	Произведение = 0;
	Для Счетчик=1 По ЧислоБ Цикл
		Произведение = Произведение + ЧислоА;
	КонецЦикла;
	Возврат Произведение;

КонецФункции

Функция ПоменятьСловаМестами(ИсходнаяСтрока)
	
	ПозицияЗапятой = СтрНайти(ИсходнаяСтрока, ",");
	ПервоеСлово = Лев(ИсходнаяСтрока, ПозицияЗапятой-1);
	ВтороеСлово = Сред(ИсходнаяСтрока, ПозицияЗапятой+1);
	СтрокаНаоборот = ВтороеСлово + "," + ПервоеСлово;
	Возврат СтрокаНаоборот;
	
КонецФункции	

Процедура ВывестиВсеРабочиеДниМесяца()
	ТекДата = ТекущаяДата();
	НачМесяца = НачалоМесяца(ТекДата);
	КонМесяца = КонецМесяца(ТекДата);
	ТекДата = НачМесяца;
	Пока ТекДата <= КонМесяца Цикл
		
		НомерДня = ДеньНедели(ТекДата);
		Если НомерДня < 6 Тогда
			ТекДатаФормат = Формат(ТекДата, "ДФ='dd.MM.yyyy (dddd)'");
			Сообщить(ТекДатаФормат);
		КонецЕсли;  
		
		ТекДата = ТекДата + 86400;
		
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	Отказ = Истина;
	ТекстПредупреждения = "Завершить работу программы?";
КонецПроцедуры


//ИсходноеЧисло = 127.25;
//Результат = ПолучитьСуммуСтрокой(ИсходноеЧисло);

//ЧислоА = 45;
//ЧислоБ = 64;
//Сообщить(ПолучитьПроизведениеЧисел(ЧислоА, ЧислоБ));

//ИсходнаяСтрока = "синий,желтый";
//Сообщить(ПоменятьСловаМестами(ИсходнаяСтрока));

//ВывестиВсеРабочиеДниМесяца();


//ТекДата = ТекущаяДата();
//КонГода = КонецГода(ТекДата);//31.12.2021

//НомерПоследнегоДня = ДеньГода(КонГода);
//Если НомерПоследнегоДня = 365 Тогда
//	Сообщить("Год не високосный");
//Иначе                             
//	Сообщить("Год високосный");
//КонецЕсли;

	
	
//Число1 = 45; 
//Число2 = 78; 
//Число3 = 66;

//Строка = "красный, желтый, синий";
//Для Счетчик=1 По 100 Цикл    
//	Слова = СтрРазделить(Строка, ",");
//КонецЦикла;

//ИсходнаяСтрока = "abc cde def"; 
//СтрокаБезДублей = "";
//КоличествоСимволов = СтрДлина(ИсходнаяСтрока);
//Для НомерСимвола=1 По КоличествоСимволов Цикл
//	ТекущийСимвол = Сред(ИсходнаяСтрока, НомерСимвола, 1);
//	РезультатПоиска = СтрНайти(СтрокаБезДублей, ТекущийСимвол);
//	Если РезультатПоиска = 0 Тогда
//		СтрокаБезДублей = СтрокаБезДублей + ТекущийСимвол;
//	КонецЕсли;
//КонецЦикла;
//Сообщить(СтрокаБезДублей);     


//СуммаСтрокой = "127 руб. 25 коп.";
//ЧастиСтроки = СтрРазделить(СуммаСтрокой, " ");
//РублиСтрокой = ЧастиСтроки[0];//"127"
//КопейкиСтрокой = ЧастиСтроки[2];//"25"
//РублиЧислом = Число(РублиСтрокой);  //127
//КопейкиЧислом = Число(КопейкиСтрокой);//25

//СуммаЧислом = РублиЧислом + КопейкиЧислом/100;
//Сообщить(СуммаЧислом);

//УсловныйОператор();
		
		

	
	

//для Число1, интервал (Число2; Число3) или интервал (Число3; Число2)
	



                              












