
Процедура СформироватьЧекККМ(Текст, СсылкаНаДокумент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Номер КАК Номер,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	РасходнаяНакладная.Контрагент КАК Контрагент,
		|	РасходнаяНакладная.Товары.(
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК Товары
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Макет = Документы.РасходнаяНакладная.ПолучитьМакет("ПФ_TXT_ЧекККМ");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(Выборка);
	Текст.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Текст.Вывести(Область);

	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	
	ВыборкаТовары = Выборка.Товары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Область.Параметры.Заполнить(ВыборкаТовары);
	    Текст.Вывести(Область);
		ИтогоКоличество = ИтогоКоличество + ВыборкаТовары.Количество;
		ИтогоСумма = ИтогоСумма + ВыборкаТовары.Сумма;
	КонецЦикла; 
	
	Область = Макет.ПолучитьОбласть("Итоги");
	Область.Параметры.ИтогоКоличество = ИтогоКоличество;
	Область.Параметры.ИтогоСумма = ИтогоСумма;
	
	Текст.Вывести(Область);

КонецПроцедуры
