
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//1. создать реквизит
	РеквизитОсновнойДоговор = Новый РеквизитФормы("ОсновнойДоговор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(РеквизитОсновнойДоговор);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
	//2. создать элемент формы
	ЭлементОсновнойДоговор = Элементы.Добавить("ОсновнойДоговор", Тип("ПолеФормы"));
	ЭлементОсновнойДоговор.ПутьКДанным = "ОсновнойДоговор";
	ЭлементОсновнойДоговор.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементОсновнойДоговор.Гиперссылка = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		//это новый элемент (ещё не записан в базу)
		Элементы.ОсновнойДоговор.Видимость = Ложь;
	Иначе
		ЭтотОбъект.ОсновнойДоговор = ПолучитьОсновнойДоговорКонтрагента(Объект.Ссылка);	
	КонецЕсли; 
	
	НовыйЭлемент = Элементы.Добавить("Наименование", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным = "Объект.Наименование";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Шрифт = Новый Шрифт(,,Истина);
	НовыйЭлемент.ЦветФона = Новый Цвет(251, 237, 158);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойДоговорКонтрагента(Контрагент)

	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Основной", Истина,,Контрагент);

	Возврат Договор;
	
КонецФункции

