
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветНавигации = Новый Цвет(252, 237, 138);
	
	//1. добавляем поле ввода "Наименование"
	Наименование = Элементы.Добавить("Наименование", Тип("ПолеФормы"));
	Наименование.ПутьКДанным = "Объект.Наименование";
	Наименование.Вид = ВидПоляФормы.ПолеВвода;
	Наименование.ЦветФона = ЦветНавигации;
	
	//2. добавляем поле ввода "Наименование полное"
	НаименованиеПолное = Элементы.Добавить("НаименованиеПолное", Тип("ПолеФормы"));
	НаименованиеПолное.ПутьКДанным = "Объект.НаименованиеПолное";      
	НаименованиеПолное.Вид = ВидПоляФормы.ПолеВвода;  
	
	//3. добвавляем тумблер "Вид контрагента"
	ВидКонтрагента = Элементы.Добавить("ВидКонтрагента", Тип("ПолеФормы"));
	ВидКонтрагента.ПутьКДанным = "Объект.ВидКонтрагента";
	ВидКонтрагента.Вид = ВидПоляФормы.ПолеПереключателя;
	ВидКонтрагента.СписокВыбора.Добавить(Перечисления.ВидыКонтрагентов.ЮридическоеЛицо);
	ВидКонтрагента.СписокВыбора.Добавить(Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель);
	ВидКонтрагента.СписокВыбора.Добавить(Перечисления.ВидыКонтрагентов.ФизическоеЛицо);
	ВидКонтрагента.ВидПереключателя = ВидПереключателя.Тумблер;  
	
	//3.1. назначаем "Вид контрагента" обработчик события "ПриИзменении" для 
	ВидКонтрагента.УстановитьДействие("ПриИзменении", "ОбновитьСвойстваЭлементовФормы");
	
	//4. добавляем обычную группу
	ГруппаИННКатегория = Элементы.Добавить("ГруппаИННКатегрия", Тип("ГруппаФормы"));
	ГруппаИННКатегория.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаИННКатегория.ОтображатьЗаголовок = Ложь;  
	ГруппаИННКатегория.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	//4.1. добавляем в группу поле ввода "ИНН"
	ИНН = Элементы.Добавить("ИНН", Тип("ПолеФормы"), ГруппаИННКатегория);
	ИНН.ПутьКДанным = "Объект.ИНН";
	ИНН.Вид = ВидПоляФормы.ПолеВвода;  
	ИНН.ЦветФона = ЦветНавигации; 
	
	//4.2. добавляем в группу кнопку "Заполнить по ИНН"
	//4.2.1. создаем новую команду "ЗаполнитьПоИнн" и задаем ей обработчик нажатия
	КомандаЗаполнитьПоИНН = Команды.Добавить("ЗаполнитьПоИНН");
	КомандаЗаполнитьПоИНН.Действие = "ЗаполнитьПоИНН";
	
	//4.2.2. добавляем кнопку и связываем ее с командой
	КнопкаЗаполнитьПоИНН = Элементы.Добавить("ЗаполнитьПоИНН", Тип("КнопкаФормы"), ГруппаИННКатегория);
	КнопкаЗаполнитьПоИНН.ИмяКоманды = "ЗаполнитьПоИНН";
	КнопкаЗаполнитьПоИНН.Заголовок = "Заполнить по ИНН";
	КнопкаЗаполнитьПоИНН.Картинка = БиблиотекаКартинок.ВводНаОсновании;
	КнопкаЗаполнитьПоИНН.Отображение = ОтображениеКнопки.Картинка;    
	
	//4.3. добавляем в группу тумблер "Категория"	
	Категория = Элементы.Добавить("Категория", Тип("ПолеФормы"), ГруппаИННКатегория);
	Категория.ПутьКДанным = "Объект.Категория";
	Категория.Вид = ВидПоляФормы.ПолеПереключателя;
	Категория.СписокВыбора.Добавить(Перечисления.КатегорииКонтрагентов.Важный);
	Категория.СписокВыбора.Добавить(Перечисления.КатегорииКонтрагентов.Обычный);
	Категория.СписокВыбора.Добавить(Перечисления.КатегорииКонтрагентов.Ключевой);
	Категория.ВидПереключателя = ВидПереключателя.Тумблер; 
	
	//5. добавляем обычную группу
	ГруппаСтранаКПП = Элементы.Добавить("ГруппаСтранаКПП", Тип("ГруппаФормы"));
	ГруппаСтранаКПП.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтранаКПП.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаСтранаКПП.ОтображатьЗаголовок = Ложь;
	
	//5.1. добавляем в группу поле ввода "Страна регистрации"
	СтранаРегистрации = Элементы.Добавить("СтранаРегистрации", Тип("ПолеФормы"), ГруппаСтранаКПП);
	СтранаРегистрации.Вид = ВидПоляФормы.ПолеВвода;
	СтранаРегистрации.ПутьКДанным = "Объект.СтранаРегистрации";
	
	//5.2. добавляем в группу поле ввода "КПП"
	КПП = Элементы.Добавить("КПП", Тип("ПолеФормы"), ГруппаСтранаКПП);
	КПП.ПутьКДанным = "Объект.КПП";         
	КПП.Вид = ВидПоляФормы.ПолеВвода;
	
	//6. добавляем гиперерссылку "Основной договор"
	//6.1. создаем реквизит "Основной договор"
	ТипДоговорыКонтрагентов = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	РеквизитОсновнойДоговор = Новый РеквизитФормы("РеквизитОсновнойДоговор", ТипДоговорыКонтрагентов);  
	
	//6.2. создаем массив добавляемых элементов
	ДобавляемыеЗначения = Новый Массив;
	ДобавляемыеЗначения.Добавить(РеквизитОсновнойДоговор);    
	
	//6.3. вызываем метод ИзменитьРеквизиты
	ИзменитьРеквизиты(ДобавляемыеЗначения);     
	
	//6.4. создаем поле надписи "Основной договор"
	ОсновнойДоговор = Элементы.Добавить("ОсновнойДоговор", Тип("ПолеФормы"));
	ОсновнойДоговор.ПутьКДанным = "РеквизитОсновнойДоговор";
	ОсновнойДоговор.Вид = ВидПоляФормы.ПолеНадписи;
	ОсновнойДоговор.Заголовок = "Основной договор";  
	ОсновнойДоговор.Гиперссылка = Истина;
	
	//6.5. присваиваем ревизиту значение договора, если контрагент не новый
	Если Объект.Ссылка.Пустая() Тогда 
		ОсновнойДоговор.Видимость = Ложь;
	Иначе 
		ЭтотОбъект.РеквизитОсновнойДоговор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Основной", Истина,, Объект.Ссылка);
	КонецЕсли;
	
	//7. добавляем обычную группу
	ГруппаФлажки = Элементы.Добавить("ГруппаФлажки", Тип("ГруппаФормы"));
	ГруппаФлажки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФлажки.ОтображатьЗаголовок = Ложь;
	ГруппаФлажки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	//7.1. добавляем в группу флажок "Покупатель"
	Покупатель = Элементы.Добавить("Покупатель", Тип("ПолеФормы"), ГруппаФлажки);
	Покупатель.ПутьКДанным = "Объект.Покупатель";
	Покупатель.Вид = ВидПоляФормы.ПолеФлажка;  
	Покупатель.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	//7.2. добавляем в группу флажок "Поставщик"
	Поставщик = Элементы.Добавить("Поставщик", Тип("ПолеФормы"), ГруппаФлажки);
	Поставщик.ПутьКДанным = "Объект.Поставщик";
	Поставщик.Вид = ВидПоляФормы.ПолеФлажка;  
	Поставщик.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	//7.3. добавляем в группу флажок "Прочие отношения"
	ПрочиеОтношения = Элементы.Добавить("ПрочиеОтношения", Тип("ПолеФормы"), ГруппаФлажки);
	ПрочиеОтношения.ПутьКДанным = "Объект.ПрочиеОтношения";
	ПрочиеОтношения.Вид = ВидПоляФормы.ПолеФлажка;  
	ПрочиеОтношения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;  
	
	//8. добавляем группу типа "Страницы" со страницами
	Страницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
	Страницы.Вид = ВидГруппыФормы.Страницы;
	
	//9. добавляем группу типа "Страница" 
	СтраницаКонтактнаяИнформация = Элементы.Добавить("СтраницаКонтактнаяИнформация", Тип("ГруппаФормы"), Страницы);
	СтраницаКонтактнаяИнформация.Вид = ВидГруппыФормы.Страница; 
	СтраницаКонтактнаяИнформация.Заголовок = "Контактная информация";
	
	//10. Добавляем таблицу "Контактная информация" для размещения элементов из табличной части справочника "Контрагенты"
	КонтактнаяИнформация = Элементы.Добавить("КонтактнаяИнформация", Тип("ТаблицаФормы"), СтраницаКонтактнаяИнформация);
	КонтактнаяИнформация.ПутьКДанным = "Объект.КонтактнаяИнформация";
	
	//10.1. добавляем в таблицу колонку "Номер строки"
	НомерСтрокиКИ = Элементы.Добавить("N", Тип("ПолеФормы"), КонтактнаяИнформация);
	НомерСтрокиКИ.ПутьКДанным = "Объект.КонтактнаяИнформация.НомерСтроки";  
	НомерСтрокиКИ.Вид = ВидПоляФормы.ПолеВвода;
	
	//10.2. добавляем в таблицу колонку "Тип"
	Тип = Элементы.Добавить("Тип", Тип("ПолеФормы"), КонтактнаяИнформация);
	Тип.ПутьКДанным = "Объект.КонтактнаяИнформация.Тип";    
	Тип.Вид = ВидПоляФормы.ПолеВвода;
	
	//10.3. добавляем в таблица колонку "Вид"
	Вид = Элементы.Добавить("Вид", Тип("ПолеФормы"), КонтактнаяИнформация);
	Вид.ПутьКДанным = "Объект.КонтактнаяИнформация.Вид";
	Вид.Вид = ВидПоляФормы.ПолеВвода;
	
	//10.4. добавляем в таблицу колонку "Значение"
	ЗначениеКИ = Элементы.Добавить("ЗначениеКИ", Тип("ПолеФормы"), КонтактнаяИнформация);
	ЗначениеКИ.ПутьКДанным = "Объект.КонтактнаяИнформация.Значение"; 
	ЗначениеКИ.Вид = ВидПоляФормы.ПолеВвода;
	
	//11. добавляем группу типа "Страница"
	СтраницаДополнительныеРеквизиты = Элементы.Добавить("СтраницаДополнительныеРеквизиты", Тип("ГруппаФормы"), Страницы);
	СтраницаДополнительныеРеквизиты.Вид = ВидГруппыФормы.Страница; 
	СтраницаДополнительныеРеквизиты.Заголовок = "Дополнительные реквизиты";
	
	//12. в группу добавляем таблицу "Дополнительные реквизиты" для размещения элементов табличной части "Дополнительные реквизиты"
	ДополнительныеРеквизиты = Элементы.Добавить("ДополнительныеРеквизиты", Тип("ТаблицаФормы"), СтраницаДополнительныеРеквизиты);
	ДополнительныеРеквизиты.ПутьКДанным = "Объект.ДополнительныеРеквизиты";    
	
	//12.1. в таблицу добавляем колонку "Номер строки"
	НомерСтрокиДопРеквизит = Элементы.Добавить("НомерСтрокиДопРеквизит", Тип("ПолеФормы"), ДополнительныеРеквизиты);
	НомерСтрокиДопРеквизит.ПутьКДанным = "Объект.ДополнительныеРеквизиты.НомерСтроки";
	НомерСтрокиДопРеквизит.Вид = ВидПоляФормы.ПолеВвода;
	
	//12.2. в таблицу добавляем поле ввода "Доп реквизит"
	ДопРеквизит = Элементы.Добавить("ДопРеквизит", Тип("ПолеФормы"), ДополнительныеРеквизиты);
	ДопРеквизит.ПутьКДанным = "Объект.ДополнительныеРеквизиты.ДопРеквизит"; 
	ДопРеквизит.Вид = ВидПоляФормы.ПолеВвода;
	
	//12.3. в таблицу добавляем колонку "Значение"
	ЗначениеДопРеквизита = Элементы.Добавить("ЗначениеДопРеквизита", Тип("ПолеФормы"), ДополнительныеРеквизиты);
	ЗначениеДопРеквизита.ПутьКДанным = "Объект.ДополнительныеРеквизиты.Значение";      
	ЗначениеДопРеквизита.Вид = ВидПоляФормы.ПолеВвода;
	
	//13. добавляем кнопку "Проверить заполнение" на командную панель 
	//13.1. создаем новую команду "ПроверитьЗаполнение" и связываем её с обработчиком
	КомандаПроверитьЗаполнение = Команды.Добавить("ПроверитьЗаполнение");
	КомандаПроверитьЗаполнение.Действие = "ПроверитьЗаполнениеНовая";
	
	//13.2. Добавляем кнопку "ПровритьЗаполнение" и связываем ее с командой
	КнопкаПроверитьЗаполнение = Элементы.Добавить("ПроверитьЗаполнение", Тип("КнопкаФормы"), КоманднаяПанель);
	КнопкаПроверитьЗаполнение.ИмяКоманды = "ПроверитьЗаполнение"; 
	КнопкаПроверитьЗаполнение.Заголовок = "Проверить заполнение";
	КнопкаПроверитьЗаполнение.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
	КнопкаПроверитьЗаполнение.Отображение = ОтображениеКнопки.КартинкаИТекст;  
	
	//14. вызываем метод, который обновляет видимость поля ИНН в зависимости от вида контрагента
	ОбновитьСвойстваЭлементовФормыНаСервере();
	
КонецПроцедуры   

&НаКлиенте
Процедура ПроверитьЗаполнениеНовая()
	
	ПроверитьЗаполнениеНоваяНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеНоваяНаСервере()
	
	КонтрагентОбъект = РеквизитФормыВЗначение("Объект"); 
	
	Если КонтрагентОбъект.ПроверитьЗаполнение() = Истина Тогда 
		Сообщить("Все данные введены корректно!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	
	//проверка на заполненность "УНП"
	Если ПустаяСтрока(Объект.ИНН) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция невозможна: не заполнен ИНН!";
		Сообщение.Поле = "Объект.ИНН";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Хост = "www.portal.nalog.gov.by";
	Ресурс = "grp/getData?unp="+СокрЛП(Объект.ИНН);
	
	//создание HTTP-соединения и HTTP-запроса
	Соединение = Новый HTTPСоединение(Хост);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("host", Хост);
	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	//отправка HTTP-запроса серверу и получение ответа
	Ответ = Неопределено;
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		Возврат;
	КонецПопытки;
	//чтение ответа HTTP-сервера
	СведенияXML = Неопределено;
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		
		СведенияXML = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		Возврат;
	КонецПопытки;
	Если ТипЗнч(СведенияXML) = Тип("ОбъектXDTO") Тогда
		Если СведенияXML.Свойства().Получить("ROW")=Неопределено Тогда
		Иначе
			НаименованиеПолноеПортал = СокрЛП(СведенияXML.ROW.VNAIMP);
			НаименованиеПортал = СокрЛП(СведенияXML.ROW.VNAIMK);
			ЮрАдресПортал = СокрЛП(СведенияXML.ROW.VPADRES);
			Если Лев(ЮрАдресПортал, 2) = ", " Тогда
				ЮрАдресПортал = Прав(ЮрАдресПортал, СтрДлина(ЮрАдресПортал) - 2);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	//проверка реквизитов на изменение, если изменились - задаем вопрос пользователю
	Если НаименованиеПолноеПортал <> Объект.НаименованиеПолное
		ИЛИ НаименованиеПортал <> Объект.Наименование Тогда
		
		ТекстВопроса = "Для УНП "+Объект.ИНН+" в государственном реестре плательщиков соответствует юридическое лицо со следующими реквизитами
		|
		| Наименование: " + НаименованиеПортал + "
		| Полное наименование: " + НаименованиеПолноеПортал + "
		| Юридический адрес: " + ЮрАдресПортал + "
		|
		|Установить данные реквизиты для текущего контрагента?";
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Наименование = НаименованиеПортал;
			Объект.НаименованиеПолное = НаименованиеПолноеПортал;
			
			ВидКИ_ЮрАдрес = ПолучитьВидКонтактнойИнформацииЮрАдрес();
			СтруктураОтбора = Новый Структура("Вид", ВидКИ_ЮрАдрес);
			МассивСтрок = Объект.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаКИ = Объект.КонтактнаяИнформация.Добавить();
				СтрокаКИ.Тип = ПолучитьТипКонтактнойИнформацииАдрес();
				СтрокаКИ.Вид = ВидКИ_ЮрАдрес;
				СтрокаКИ.Значение = ЮрАдресПортал;
			Иначе
				МассивСтрок[0].Значение = ЮрАдресПортал;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьТипКонтактнойИнформацииАдрес()

	Возврат Перечисления.ТипыКонтактнойИнформации.Адрес;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидКонтактнойИнформацииЮрАдрес()

	Возврат Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;

КонецФункции

&НаСервере
Процедура ОбновитьСвойстваЭлементовФормыНаСервере()

	Если Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		Элементы.Наименование.Заголовок = "ФИО";
		Элементы.ИНН.Видимость = Ложь;
		Элементы.ЗаполнитьПоИНН.Видимость = Ложь;
	Иначе
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ИНН.Видимость = Истина;
		Элементы.ЗаполнитьПоИНН.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвойстваЭлементовФормы()

	ОбновитьСвойстваЭлементовФормыНаСервере();

КонецПроцедуры // СообщитьОСобытии()
