
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьЗаказа)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаказа(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаказа(ТабДок, ПараметрКоманды)
	Документы.ЗаказКлиента.ПечатьЗаказа(ТабДок, ПараметрКоманды);
КонецПроцедуры
