Процедура ЗаполнитьНаименованиеПоШаблону() Экспорт
	
	Наименование = "Договор № " + Номер + " от " + Формат(ДатаДоговора, "ДФ=dd.MM.yyyy");

КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если (ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем И Владелец.Покупатель = Ложь)
		ИЛИ (ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком И Владелец.Поставщик = Ложь)
		ИЛИ (ВидДоговора = Перечисления.ВидыДоговоров.Прочее И Владелец.ПрочиеОтношения = Ложь) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вид договора не соответствует типу отношений с контрагентом";
		Сообщение.Сообщить();
	КонецЕсли; 
	
	Если Владелец.Покупатель Тогда
		ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
	ИначеЕсли Владелец.Поставщик = Истина Тогда
		ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком;
	КонецЕсли; 
	
	//Если Владелец.Покупатель = Истина И Владелец.Поставщик = Истина Тогда 
	//	ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком;
	//КонецЕсли

	
КонецПроцедуры
 