
&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	СоздатьЗаказПоставщикуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаказПоставщикуНаСервере()
	
	НовыйЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
	НовыйЗаказ.Дата = ТекущаяДата();
	
	ДанныеЗаполнения = Новый Структура;
	
	ДанныеЗаполнения.Вставить("Организация", Организация);
	ДанныеЗаполнения.Вставить("Контрагент", Контрагент);
	ДанныеЗаполнения.Вставить("Номенклатура", Номенклатура);
	
	НовыйЗаказ.Заполнить(ДанныеЗаполнения);//событие ОбработкаЗаполнения
	
	НовыйЗаказ.Записать();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создан документ: " + НовыйЗаказ.Ссылка;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьРасширениеФайла(Команда)
	
	ПутьКФайлу = "E:\JAVASCRIPTCORE.RESOURCES1\Info.plist";
	МассивСлов = СтрРазделить(ПутьКФайлу, ".", Истина);
	Если МассивСлов.Количество() > 0 Тогда
		ИндексПоследнего = МассивСлов.ВГраница();
		Расширение = МассивСлов[ИндексПоследнего];
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл имеет расширение " + ВРег(Расширение);
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры










&НаКлиенте
Процедура ВыполнитьПроцедуруОбщегоМодуля(Команда)
	ВыполнитьПроцедуруОбщегоМодуляНаСервере();
	ТестовыйМодуль.ПоказатьТекстСообщения();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроцедуруОбщегоМодуляНаСервере()
	ТестовыйМодуль.ПоказатьТекстСообщения();
КонецПроцедуры







