
&НаКлиенте
Процедура ПрочитатьДвижения(Команда)
	ПрочитатьДвиженияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДвиженияНаСервере()

	Объект.ДвиженияДокумента.Очистить();
	
	//1. Через выборку (нельзя изменить данные, только прочитать)
	Движения = РегистрыНакопления.ТоварыНаСкладах.ВыбратьПоРегистратору(Объект.Документ);

	Пока Движения.Следующий() Цикл
		НоваяСтрока = Объект.ДвиженияДокумента.Добавить();
		НоваяСтрока.ВидДвижения	 = Движения.ВидДвижения;
		НоваяСтрока.НС			 = Движения.НомерСтроки;
		НоваяСтрока.Регистратор	 = Движения.Регистратор;
		НоваяСтрока.Организация	 = Движения.Организация;
		НоваяСтрока.Склад		 = Движения.Склад;
		НоваяСтрока.Номенклатура = Движения.Номенклатура;
		НоваяСтрока.Количество	 = Движения.Количество;
	КонецЦикла; 
	
	//2. Через набор записей (можно и прочитать и изменить)
	НаборЗаписей = РегистрыНакопления.ТоварыНаСкладах.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Документ);
	
	НаборЗаписей.Прочитать();
	
	Для каждого Запись Из НаборЗаписей Цикл
		НоваяСтрока = Объект.ДвиженияДокумента.Добавить();
		НоваяСтрока.ВидДвижения	 = Запись.ВидДвижения;
		НоваяСтрока.НС			 = Запись.НомерСтроки;
		НоваяСтрока.Регистратор	 = Запись.Регистратор;
		НоваяСтрока.Организация	 = Запись.Организация;
		НоваяСтрока.Склад		 = Запись.Склад;
		НоваяСтрока.Номенклатура = Запись.Номенклатура;
		НоваяСтрока.Количество	 = Запись.Количество;
	КонецЦикла; 
	
	//НаборЗаписей = РегистрыНакопления.ТоварыНаСкладах.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Склад.Установить(Объект.Склад);
	//
	//НаборЗаписей.Прочитать();

	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстатки(Команда)
	ПрочитатьОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьОстаткиНаСервере()
	
	СтруктураОтбора = Новый Структура;
	Если НЕ Объект.Номенклатура.Пустая() Тогда
		СтруктураОтбора.Вставить("Номенклатура", Объект.Номенклатура);
	КонецЕсли; 
	
	Если НЕ Объект.Склад.Пустая() Тогда
		СтруктураОтбора.Вставить("Склад", Объект.Склад);
	КонецЕсли; 
	
	//1. Остатки на дату
	ТаблицаОстатков = РегистрыНакопления.ТоварыНаСкладах.Остатки(ДатаОстатков, СтруктураОтбора);
	
	//2. Остатки на момент времени (не включая)
	МоментВремени = Новый МоментВремени(ДатаОстатков, Объект.Документ);
	ТаблицаОстатков = РегистрыНакопления.ТоварыНаСкладах.Остатки(МоментВремени, СтруктураОтбора);

	//3. Остатки на момент времени (включая)
	МоментВремени = Новый МоментВремени(ДатаОстатков, Объект.Документ);
	Граница = Новый Граница(МоментВремени, ВидГраницы.Включая);
	ТаблицаОстатков = РегистрыНакопления.ТоварыНаСкладах.Остатки(Граница, СтруктураОтбора);
	
	Объект.Остатки.Очистить();
	
	Для каждого СтрокаОстатков Из ТаблицаОстатков Цикл
		НоваяСтрока = Объект.Остатки.Добавить();
		//НоваяСтрока.Организация	 = СтрокаОстатков.Организация;
		//НоваяСтрока.Номенклатура = СтрокаОстатков.Номенклатура;
		//НоваяСтрока.Склад		 = СтрокаОстатков.Склад;
		//НоваяСтрока.Количество	 = СтрокаОстатков.Количество;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОбороты(Команда)
	ПрочитатьОборотыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьОборотыНаСервере()
	
	Объект.Обороты.Очистить();
	
	СтруктураОтбора = Новый Структура;
	Если НЕ Объект.Номенклатура.Пустая() Тогда
		СтруктураОтбора.Вставить("Номенклатура", Объект.Номенклатура);
	КонецЕсли; 
	
	Если НЕ Объект.Склад.Пустая() Тогда
		СтруктураОтбора.Вставить("Склад", Объект.Склад);
	КонецЕсли; 
	
	ТаблицаОборотов = РегистрыНакопления.Продажи.Обороты(ПериодОборотов.ДатаНачала, ПериодОборотов.ДатаОкончания, СтруктураОтбора);
	
	Для каждого СтрокаОборотов Из ТаблицаОборотов Цикл
		НоваяСтрока = Объект.Обороты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОборотов); 	
	КонецЦикла; 
	
КонецПроцедуры

