
#Область Задача1

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументНаСервере()
	
	//1. Создать документ "Заказ клиента", заполнить реквизиты следующими значениями:
	//Организация:  "Электроник ООО"
	//Склад:		"Основной" 
	//Контрагент:	"Агроимпульс ТД ООО"
	//Договор:		"Договор № б/н от 12.10.2021"
	//***Табличная часть "Товары"***
	//Номенклатура: "Холодильник ATLANT ХМ 4208-000"
	//Количество: 7 шт.
	//Цена: 17900 руб.
	//***
	//Единицу измерения, ставку ндс заполнить значениями из номенклатуры
	//Суммы в строке должны быть рассчитаны по аналогии с тем, как описано в модуле формы документа

		
КонецПроцедуры

#КонецОбласти

#Область Задача2

&НаКлиенте
Процедура НайтиДокумент(Команда)
	НайтиДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиДокументНаСервере()
	
	//2. Найти документ "Заказ клиента" с номером "00000000003" (в этом году)
	
КонецПроцедуры

#КонецОбласти

#Область Задача3

&НаКлиенте
Процедура ИзменитьДокумент(Команда)
	ИзменитьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДокументНаСервере()
	
	//3. Изменить документ "Заказ клиента" с номером "00000000005" (в этом году):
	//Увеличить цены во всех строках табличной части "Товары" на 10% и пересчитать суммы
	
КонецПроцедуры

#КонецОбласти

#Область Задача4

&НаКлиенте
Процедура ЗаполнитьНаОсновании(Команда)
	ЗаполнитьНаОснованииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииНаСервере()
	
	//4. На основании документа "Заказ клиента" с номером "00000000005" создать документ "Расходная накладная"
		
КонецПроцедуры

#КонецОбласти

#Область Задача5

&НаКлиенте
Процедура ВыбратьДокументы(Команда)
	ВыбратьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьДокументыНаСервере()
	
	//5. Выбрать все документы "Заказ клиента" за ноябрь 2021 года по контрагенту "ООО "Рога и Копыта"" 
	//и вывести в виде сообщений номера и суммы документов
	//Пример: 
	//"Заказ № 000001 на сумму 20000 рублей"
	//"Заказ № 000003 на сумму 67500 рублей"
	
КонецПроцедуры

#КонецОбласти

#Область Задача6

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	ПровестиДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументНаСервере()
	
	//6. Провести все документы "Заказ клиента" за ноябрь 2021 года
		
КонецПроцедуры

#КонецОбласти

#Область Задача7

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	ОтменитьПроведениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведениеНаСервере()
	
	//7. Отменить проведение документа "Заказ клиента" с номером "00000000005"
	
КонецПроцедуры

#КонецОбласти