
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Партии Приход
	Движения.Партии.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Партии.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.СрокГодности = ТекСтрокаТовары.СрокГодности;
		Движение.Количество = ТекСтрокаТовары.Количество;   
		Движение.Партия = Ссылка;
	КонецЦикла; 
	
	// регистр ТоварыВНаличии Приход
	Движения.ТоварыВНаличии.Записывать = Истина;
	Для каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыВНаличии.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры
