
&НаКлиенте
Процедура Поехали(Команда)
	ПоехалиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоехалиНаСервере()
	ПолучитьДанныеДляТЧДокументыРеализации();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляТЧДокументыРеализации()
	
	Результат = Неопределено;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Запрос 1
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДАННЫЕ
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата < &Дата
	|	И РеализацияТоваровУслуг.Договор = &Договор
	|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДАННЫЕ.*
	|ИЗ
	|	ВТ_ДАННЫЕ КАК ВТ_ДАННЫЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	       
	// Запрос 2. Динамически формируем запрос для получения связанных документов
	Если Не РезультатЗапроса.Пустой() Тогда
		ЗапросСвязанныеДокуметы = Новый Запрос;
		ЗапросСвязанныеДокуметы.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросСвязанныеДокуметыМассив = Новый Массив;
		Счетчик = 1;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИсходныйЗапросСвязанныеДокуметы = "ВЫБРАТЬ
			|СвязанныеДокументы.Ссылка КАК Ссылка,
			|&Значение" + Счетчик + " КАК ИсходныйДокумент"
			+ (?(Счетчик = 1, Символы.ПС + "ПОМЕСТИТЬ ВТ_СвязанныеДокументы", "")) + "
			|	ИЗ
			|КритерийОтбора.СвязанныеДокументы(&Значение%Счетчик%) КАК СвязанныеДокументы
			|	ГДЕ
			|ТипЗначения(СвязанныеДокументы.Ссылка) = ТИП(Документ.СчетФактураВыданный)";
			ЗапросСвязанныеДокуметыМассив.Добавить(СтрЗаменить(ИсходныйЗапросСвязанныеДокуметы, "%Счетчик%", Счетчик)); 
			ЗапросСвязанныеДокуметы.УстановитьПараметр("Значение" + Счетчик, Выборка.Ссылка);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		ЗапросСвязанныеДокуметы.Текст = СтрСоединить(ЗапросСвязанныеДокуметыМассив, Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ " + Символы.ПС + Символы.ПС);
		ЗапросСвязанныеДокуметы.Текст = ЗапросСвязанныеДокуметы.Текст + ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СвязанныеДокументы.*
		|ИЗ
		|	ВТ_СвязанныеДокументы КАК ВТ_СвязанныеДокументы";
		ЗапросСвязанныеДокуметы = ЗапросСвязанныеДокуметы.Выполнить();
		// Результат = ЗапросСвязанныеДокуметы.Выгрузить();
		
		// Запрос 3. Итоговый
		ЗапросИтоговый = Новый Запрос;
		ЗапросИтоговый.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросИтоговый.Текст = "ВЫБРАТЬ 
		|	Данные.*,
		|   ЕСТЬNULL(СвязанныеДокументы.Ссылка, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК СчетФактура
		|ИЗ ВТ_ДАННЫЕ КАК Данные
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязанныеДокументы КАК СвязанныеДокументы
		|	ПО (СвязанныеДокументы.ИсходныйДокумент = Данные.Ссылка)
		|";
	Иначе
		// Запрос 3. Итоговый
		ЗапросИтоговый = Новый Запрос;
		ЗапросИтоговый.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросИтоговый.Текст = "ВЫБРАТЬ 
		|	Данные.*,
		|   ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка) КАК СчетФактура
		|ИЗ ВТ_ДАННЫЕ КАК Данные
		|";
	КонецЕсли;
	
	РезультатЗапросаИтоговый = ЗапросИтоговый.Выполнить();
		
	Возврат Результат;
КонецФункции
