
&НаКлиенте
Процедура Вопрос1(Команда)
	
	Число1 = 45;
	Число2 = 58;
	Произведение = Число1*Число2;
	
	//вариант 1
	Если Произведение%2 = 0 Тогда
		Сообщить("Произведение четное");
	КонецЕсли; 
	
	//вариант2
	Если Произведение%2 = 0 Тогда
		Сообщить("Произведение четное");
	Иначе
		Сообщить("Произведение не четное");
	КонецЕсли; 

	//вариант 3
	Если Произведение%2 = 0 Тогда
		Сообщить("Произведение четное");
	ИначеЕсли Произведение%3 = 0 Тогда
		Сообщить("Произведение кратное трем");
	Иначе
		Сообщить("Произведение не четное");
	КонецЕсли;
	
	//вариант4
	Если Произведение%2 <> 0 Тогда
		Сообщить("Произведение не четное");		
	Иначе
		Сообщить("Произведение четное");
	КонецЕсли; 

	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлемент(Команда)
	
	СоздатьЭлементНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементНаСервере()

	РезультатПоиска = Элементы.Найти("Номенклатура");
	
	Если РезультатПоиска = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("Номенклатура", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Номенклатура";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элемент уже создан";
		Сообщение.Поле = "Номенклатура";
		Сообщение.Сообщить();
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура СоздатьЭлементМного(Команда)
	СоздатьЭлементМногоНаСервере();
КонецПроцедуры


&НаСервере
Процедура СоздатьЭлементМногоНаСервере()
	
	Идентификатор = Новый УникальныйИдентификатор;
	
	ИмяЭлемента = "Номенклатура_" + СтрЗаменить(Идентификатор, "-", "");
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным = "Номенклатура";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;

КонецПроцедуры


&НаКлиенте
Процедура ИзменитьЭлемент(Команда)
	
	РезультатПоиска = Элементы.Найти("Номенклатура");
	
	Если РезультатПоиска <> Неопределено Тогда
		Элементы.Номенклатура.Заголовок = Элементы.Номенклатура.Заголовок + " " + ТекущаяДата();	
	КонецЕсли; 
	
КонецПроцедуры

