
&НаСервере
Процедура СоздатьКонтрагента()

	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();

	НовыйКонтрагент.ВидКонтрагента		= Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	НовыйКонтрагент.Категория			= Перечисления.КатегорииКонтрагентов.Обычный;
	НовыйКонтрагент.Покупатель			= Истина;
	НовыйКонтрагент.Наименование		= "Тестовый контрагент";
	НовыйКонтрагент.НаименованиеПолное	= "Тестовый контрагент";
	НовыйКонтрагент.ИНН					= "123";
	
	НовыйКонтрагент.ПроверитьЗаполнение();
	
	НовыйКонтрагент.Записать();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговор()
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();

	НовыйДоговор.Владелец		= Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "123");
	НовыйДоговор.Номер			= "1";
	НовыйДоговор.ДатаДоговора	= ТекущаяДата() + "пять";
	НовыйДоговор.ВидДоговора	= Перечисления.ВидыДоговоров.СПокупателем;
	НовыйДоговор.ЗаполнитьНаименованиеПоШаблону();
	
	НовыйДоговор.Записать();
	
КонецПроцедуры
			
#Область ИспользованиеЯвнойТранзакции

&НаКлиенте
Процедура СоздатьКонтрагентаИДоговор_ВТранзакции(Команда)
	СоздатьКонтрагентаИДоговор_ВТранзакцииНаСервере();

	ОповеститьОбИзменении(Тип("СправочникСсылка.Контрагенты"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.ДоговорыКонтрагентов"));

КонецПроцедуры

&НаСервере
Процедура СоздатьКонтрагентаИДоговор_ВТранзакцииНаСервере()
	
	НачатьТранзакцию();
	
	СоздатьКонтрагента();	
	
	СоздатьДоговор();	

	ЗафиксироватьТранзакцию();

КонецПроцедуры

#КонецОбласти
		
#Область БезИспользованияЯвнойТранзакции

&НаКлиенте
Процедура СоздатьКонтрагентаИДоговор_БезТранзакции(Команда)
	
	СоздатьКонтрагентаИДоговор_БезТранзакцииНаСервере();

	ОповеститьОбИзменении(Тип("СправочникСсылка.Контрагенты"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.ДоговорыКонтрагентов"));

КонецПроцедуры

&НаСервере
Процедура СоздатьКонтрагентаИДоговор_БезТранзакцииНаСервере()

	СоздатьКонтрагента();
	СоздатьДоговор();

КонецПроцедуры

#КонецОбласти
