
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//1. Создать новый табличный документ
	ТабДок = Новый ТабличныйДокумент;
	
	//2. Заполнить табличный документ, используя области из макета
	ОбработкаКомандыНаСервере(ПараметрКоманды, ТабДок);
	
	
	//3. Настроить свойства табличного документа
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	//4. Показать документ пользователю
	ТабДок.Показать();
	
КонецПроцедуры  

&НаСервере
Процедура ОбработкаКомандыНаСервере(МассивДокументов, ТабДок)
	
	Документы.АктВыполненныхРабот.ПечатьАктаВыполненныхРабот(МассивДокументов, ТабДок, Истина);

КонецПроцедуры // ОбработкаКомандыНаСервере()

