
&НаКлиенте
Процедура Команда1(Команда)
	
	А = 0;
	Если А > 0 Тогда
		Сообщить("А=" + А);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПроцедуры()
	
	А = 0;
	
	Если А=0 Тогда
	КонецЕсли; 
	
	Пока А>0 Цикл
	КонецЦикла;  
	
	Массив = Новый Массив;
	Для каждого ЭлементМассива Из Массив Цикл
	
	КонецЦикла; 
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура НоваяПроцедура()


КонецПроцедуры // НоваяПроцедура()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ПроцедураСЗаголовком()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("");
	Таблица.Колонки.Добавить("");
	Таблица.Колонки.Добавить("");
	Таблица.Колонки.Добавить("");
	Таблица.Колонки.Добавить("");
		
	
КонецПроцедуры // ПроцедураСЗаголовком()




