
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Фильтр = "CSV-файл | *.csv";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПутьКФайлу = ВыбранныеФайлы[0];

	ДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
	
	Отчет.АдресДанных = ПоместитьВоВременноеХранилище(ДанныеФайла);
	Элементы.НадписьФайлВыбран.Заголовок = "Файл выбран";
	Элементы.НадписьФайлВыбран.ЦветТекста = Новый Цвет(0,128,0);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ПустаяСтрока(Отчет.АдресДанных) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сначала выберите файл";
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры
