
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредства Приход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.БанковскийСчет = БанковскийСчет;
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	ОтразитьРасчетыСКлиентами();
	
	
КонецПроцедуры


Процедура ОтразитьРасчетыСКлиентами()

	Движения.РасчетыСКлиентами.Записывать = Истина;
	Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		
		Движение = Движения.РасчетыСКлиентами.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = СтрокаРасшифровки.Договор;
		Движение.Сумма = СтрокаРасшифровки.СуммаПлатежа;
		
	КонецЦикла; 

КонецПроцедуры
