
&НаКлиенте
Процедура ЗаполнитьПолноеНаименование(Команда)
	
	Объект.НаименованиеПолное = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуТовара(Команда)

	Если ПустаяСтрока(Объект.АдресНаСайте) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан адрес страницы товара!";
		Сообщение.Поле = "Объект.АдресНаСайте";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
		
	Попытка                                                                                		
		ПерейтиПоНавигационнойСсылке(Объект.АдресНаСайте);
	Исключение
		Сообщить("Не удалось открыть страницу товара. Возможно, указана некорректная ссылка");
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ПутьВКаталогеНаСервере()
	
	//1. Преобразование ДанныеФормыСтруктура -> СправочникОбъект.Контрагенты
	НоменклатураОбъект = РеквизитФормыВЗначение("Объект");
	
	//2. Вызов метода "ПолноеНаименование()" для объекта СправочникОбъект.Контрагенты
	ПутьВКаталоге = НоменклатураОбъект.ПолноеНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВКаталоге(Команда)
	ПутьВКаталогеНаСервере();
КонецПроцедуры
