
&НаКлиенте
Процедура ПросмотрСодержимогоВременныхТаблиц(Команда)
	ПросмотрСодержимогоВременныхТаблицНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПросмотрСодержимогоВременныхТаблицНаСервере()
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	//выполнить 1-й запрос
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаКон", '20211104235959');
	Запрос.УстановитьПараметр("ДатаНач", '20211104');
	
	РезультатЗапроса1 = Запрос.Выполнить();
	
	//выполить 2-й запрос
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяТовары.Количество КАК Количество,
	|	ПриходнаяНакладнаяТовары.СуммаВсего КАК СуммаВсего
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	|		ПО ПриходнаяНакладнаяТовары.Ссылка = ВТ_Документы.Ссылка";
	
	РезультатЗапроса2 = Запрос2.Выполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийВЗапросе(Команда)
	ТаблицаЗначенийВЗапросеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаЗначенийВЗапросеНаСервере()
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Товар", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	
	СтрокаТаблицы = ТаблицаТоваров.Добавить();
	СтрокаТаблицы.Товар = "Микрофон";
	СтрокаТаблицы.Цена = 100;
	
	СтрокаТаблицы = ТаблицаТоваров.Добавить();
	СтрокаТаблицы.Товар = "Клавиатура";
	СтрокаТаблицы.Цена = 20;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.Товар КАК Товар,
		|	ТаблицаТовары.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Товар КАК Товар,
		|	ВТ_Товары.Цена КАК Цена
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|ИТОГИ
		|	МАКСИМУМ(Цена)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТоваров);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
		
	
КонецПроцедуры
