
Функция ПолучитьРеквизитыНоменклатуры(Номенклатура, СписокИменРеквизитов) Экспорт

	Если Номенклатура.Пустая() Тогда
	 	Возврат Неопределено;
	КонецЕсли; 
	
	МассивРеквизитов = СтрРазделить(СписокИменРеквизитов, ",");
	
	НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
	
	РеквизитыСтруктура = Новый Структура;
	
	МетаданныеНоменклатуры = Метаданные.Справочники.Номенклатура;
	
	РеквизитыСправочника = МетаданныеНоменклатуры.Реквизиты;
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если РеквизитыСправочника.Найти(ИмяРеквизита) = Неопределено Тогда
			ЗначениеРеквизита = Неопределено;
		Иначе
			ЗначениеРеквизита = НоменклатураОбъект[ИмяРеквизита];				
		КонецЕсли; 
		
		РеквизитыСтруктура.Вставить(ИмяРеквизита, ЗначениеРеквизита);
		
	КонецЦикла; 
		
	Возврат РеквизитыСтруктура;

КонецФункции // ДолучитьРеквизитыНоменклатуры()
