
&НаКлиенте
Процедура Команда1(Команда)
	
	Числитель = 125;
	Знаменатель = 0;
	
	Попытка
		Результат = Числитель/Знаменатель;
	Исключение
		//Сообщить(ОписаниеОшибки());
		Инфо = ИнформацияОбОшибке();
		Сообщить(НСтр("ru='Описание=';en='Description='") + Инфо.Описание + "'");
		Сообщить(НСтр("ru='ИмяМодуля=';en='ModuleName='") + Инфо.ИмяМодуля + "'");
		Сообщить(НСтр("ru='НомерСтроки=';en='LineNumber='") + Инфо.НомерСтроки + "'");
		Сообщить(НСтр("ru='ИсходнаяСтрока=';en='SourceLine='") + Инфо.ИсходнаяСтрока + "'");
		//ВызватьИсключение;
	КонецПопытки
	
;КонецПроцедуры
