
&НаКлиенте
Процедура ЗадачиНаУсловныйОператор(Команда)
	
	//ЗАДАЧА 2 (среднее из 3-х чисел)
	Число1 = 45;
	Число2 = 64;
	Число3 = 11;
	
	Если Число1 = Число2 И Число1 = Число3 Тогда
		Сообщить("Все числа равны");
		Среднее = Неопределено;
	ИначеЕсли (Число1 > Число2 И Число1 < Число3) ИЛИ (Число1 > Число3 И Число1 < Число2) Тогда
		Среднее = Число1;
	ИначеЕсли (Число2 > Число1 И Число2 < Число3) ИЛИ (Число2 > Число3 И Число2 < Число1) Тогда
		Среднее = Число2;
	ИначеЕсли (Число3 > Число1 И Число3 < Число2) ИЛИ (Число3 > Число1 И Число3 < Число2) Тогда
		Среднее = Число3;
	КонецЕсли;
	
	Сообщить(Среднее);
	
	//ЗАДАЧА 3 (Проверка делимости)
	А = 15; 
	Б = 4;
	
	Если Б = 0 Тогда
		Сообщить("Деление на ноль!");
	Иначе
		
		ОстатокОтДеления = А%Б;
		Если ОстатокОтДеления = 0 Тогда
			Сообщить("ЧислоА делится на ЧислоБ нацело");
		Иначе                                    
			Сообщить("ЧислоА не делится на ЧислоБ. Остаток от деления: " + ОстатокОтДеления);
		КонецЕсли;
		
		Частное = А/Б; 
		Сообщить("А/Б = " + Частное);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОператорПрисваивания(Команда)

	ЧислоА = 7;
	ЧислоБ = 5;
	ЧислоА = (ЧислоБ = 5);
	
	Сообщить(ЧислоА);

КонецПроцедуры

&НаКлиенте
Процедура УбратьЦифрыИзСтроки(Команда)
	
	ИсходнаяСтрока = "  Это  стро4ка с 8 цифрами 7"; 
	
	Сообщить(УдалитьЦифры(ИсходнаяСтрока));
	Сообщить(ИсходнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Функция УдалитьЦифры(Знач ИсходнаяСтрока)
	
	СтрокаЦифр = "0123456789"; 
	
	Для НомерСимвола=1 По 10 Цикл
		
		ТекСимвол = Сред(СтрокаЦифр, НомерСимвола, 1);
		РезультатПоиска = СтрНайти(ИсходнаяСтрока, ТекСимвол); 
		Если РезультатПоиска > 0 Тогда
			ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока, ТекСимвол, "");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИсходнаяСтрока;  
	
КонецФункции

&НаКлиенте
Процедура ДатаСтрокойВДату(Команда)
	
	//Нужно из строки вида "12 февраля 2020 г." получить дату и сообщить пользователю.
	//Пример:
	//Исходная строка: "24 марта 2020 г."
	//Результат (дата): 24.03.2020
	
	ИсходнаяСтрока = "11 января 2021 г.";
	                  	
	МассивСлов = СтрРазделить(ИсходнаяСтрока, " ", Ложь);
	Если МассивСлов.Количество() < 3 Тогда
		Сообщить("Неверен формат!");
		Возврат;
	КонецЕсли;  

	ДеньСтрокой = МассивСлов[0];
	МесяцСловами = МассивСлов[1];
	ГодСтрокой = МассивСлов[2];
	
	Если МесяцСловами = "января" Тогда
		МесяцСтрокой = "01";
	ИначеЕсли МесяцСловами = "февраля" Тогда
		МесяцСтрокой = "02";
	ИначеЕсли МесяцСловами = "марта" Тогда
		МесяцСтрокой = "03";
	ИначеЕсли МесяцСловами = "апреля" Тогда
		МесяцСтрокой = "04";
	ИначеЕсли МесяцСловами = "мая" Тогда
		МесяцСтрокой = "05";
	ИначеЕсли МесяцСловами = "июня" Тогда
		МесяцСтрокой = "06";
	ИначеЕсли МесяцСловами = "июля" Тогда
		МесяцСтрокой = "07";
	ИначеЕсли МесяцСловами = "августа" Тогда
		МесяцСтрокой = "08";
	ИначеЕсли МесяцСловами = "сентября" Тогда
		МесяцСтрокой = "09";
	ИначеЕсли МесяцСловами = "октября" Тогда
		МесяцСтрокой = "10";
	ИначеЕсли МесяцСловами = "ноября" Тогда
		МесяцСтрокой = "1";
	ИначеЕсли МесяцСловами = "декабря" Тогда
		МесяцСтрокой = "1"; 
	Иначе
		Сообщить("Неверен формат!");
		Возврат;
	КонецЕсли;

	ДатаВНужномФормате = ГодСтрокой + МесяцСтрокой + ДеньСтрокой;
	ДатаИтог = Дата(ДатаВНужномФормате);	
	
	Сообщить(ДатаИтог);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементМассива(Команда)

	//Создайте массив МассивДат и добавьте в него все даты одного месяца 
	//(например, с 01.09.2021 по 30.09.2021), используя цикл. 
	//После этого удалите из массива все даты, которые являются днями недели 
	//"суббота" или "воскресенье". 
	//После удаления в массиве МассивДат должны остаться только те даты, 
	//для которых день недели с понедельника по пятницу. 
	//Выведите все значения массива на экран в виде сообщений.
	
	МассивДат = Новый Массив;
	ТекДата = НачалоМесяца(ТекущаяДата());
	КонДата = КонецМесяца(ТекущаяДата());
	Пока ТекДата <= КонДата Цикл
		МассивДат.Добавить(ТекДата);	
		ТекДата = ТекДата + 86400;
	КонецЦикла;  
	
	//КАК НЕПРАВИЛЬНО
	//Для каждого ТекДата Из МассивДат Цикл
	//	
	//	НомерДняНедели = ДеньНедели(ТекДата); 
	//	Если НомерДняНедели > 5 Тогда
	//		Индекс = МассивДат.Найти(ТекДата);
	//		МассивДат.Удалить(Индекс);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	//КАК ПРАВИЛЬНО
	Индекс = МассивДат.ВГраница();
	Пока Индекс >= 0 Цикл
		
		ТекДата = МассивДат[Индекс];
		НомерДняНедели = ДеньНедели(ТекДата); 
		Если НомерДняНедели > 5 Тогда
			МассивДат.Удалить(Индекс);
		КонецЕсли;    
		
		Индекс = Индекс - 1;
		
	КонецЦикла;       
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДублиИзМассива(Команда)

	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить("Иванов");
	МассивСотрудников.Добавить("Иванов");
	МассивСотрудников.Добавить("Иванов");
	МассивСотрудников.Добавить("Иванов");
	МассивСотрудников.Добавить("Романов");
	МассивСотрудников.Добавить("Лукьянович");
	МассивСотрудников.Добавить("Лукьянович");

	//создаем новый пустой массив
	МассивБезДублей = Новый Массив;
	Для каждого Фамилия Из МассивСотрудников Цикл
		Если МассивБезДублей.Найти(Фамилия) = Неопределено Тогда
			МассивБезДублей.Добавить(Фамилия);	
		КонецЕсли;
	КонецЦикла; 
	
	//Способ 2. Удаление дублей через ТЧ
	//УдалитьДублиНаСервере(МассивБезДублей);
	
КонецПроцедуры     

&НаСервере
Процедура УдалитьДублиНаСервере(ИсходныйМассив)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Значение");
	Таблица.ЗагрузитьКолонку(ИсходныйМассив, "Значение");
	Таблица.Свернуть("Значение");
	ИсходныйМассив = Таблица.ВыгрузитьКолонку("Значение");
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиТоварСМинимальнойЦеной(Команда)

	МассивТоваров = Новый Массив;
	
	Товар1 = Новый Структура("Артикул, Наименование, Штрихкод, Цена");
	Товар1.Артикул = "184601023";
	Товар1.Наименование = "Смартфон Xiaomi Redmi 9 3/32GB, зеленый";
	Товар1.Штрихкод = "978020137962";
	Товар1.Цена = 418.12;
	
	МассивТоваров.Добавить(Товар1);

	Товар2 = Новый Структура("Артикул, Наименование, Штрихкод, Цена");
	Товар2.Артикул = "215543732";
	Товар2.Наименование = "Смартфон Samsung Galaxy A12";
	Товар2.Штрихкод = "478020147962";
	Товар2.Цена = 352.55;
	
	МассивТоваров.Добавить(Товар2);

	Товар3 = Новый Структура("Артикул, Наименование, Штрихкод, Цена");
	Товар3.Артикул = "254514022";
	Товар3.Наименование = "Смартфон Poco X3 Pro 8";
	Товар3.Штрихкод = "448021147962";
	Товар3.Цена = 734.07;
	
	МассивТоваров.Добавить(Товар3);
	
	Если МассивТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТоварСМинЦеной = МассивТоваров[0];//Структура
	Для каждого Товар Из МассивТоваров Цикл
		Если Товар.Цена < ТоварСМинЦеной.Цена Тогда
			ТоварСМинЦеной = Товар;
		КонецЕсли;
	КонецЦикла;  
	
	//Самый дешевый товар: Смартфон Samsung Galaxy A12, цена: 352 руб. 55 коп." 
	ЦенаЧислом = ТоварСМинЦеной.Цена;
	ЦенаСтрокой = "" + Цел(ЦенаЧислом) + " руб. " + (ЦенаЧислом - Цел(ЦенаЧислом))*100 + " коп.";
	Сообщить("Самый дешевый товар: " + ТоварСМинЦеной.Наименование + ", цена: " + ЦенаСтрокой);

КонецПроцедуры

&НаКлиенте
Процедура ОшибкаПередачиНедопустимогоТипа(Команда)
	
	Таблица = ПолучитьТаблицуТоваров();
	
КонецПроцедуры     

&НаСервере
Функция ПолучитьТаблицуТоваров()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Товар");
	Таблица.Колонки.Добавить("Артикул");
	
	мсДанных = Новый Массив;
	
	Для Каждого СтрокаТЗ Из Таблица Цикл   
		
		стСтрокаТаблицы = Новый Структура;
		
		Для Каждого ИмяКолонки Из Таблица.Колонки Цикл
			
			стСтрокаТаблицы.Вставить(ИмяКолонки.Имя, СтрокаТЗ[ИмяКолонки.Имя]);
			
		КонецЦикла;   
		
		мсДанных.Добавить(стСтрокаТаблицы);   
		
	КонецЦикла;
	
	Возврат мсДанных;
	
КонецФункции

&НаКлиенте
Процедура СоответствиеДат(Команда)
	
	СоответствиеДат = Новый Соответствие;
	ТекДата = НачалоМесяца(ТекущаяДата());
	КонДата = КонецМесяца(ТекущаяДата());
	Пока ТекДата <= КонДата Цикл
		ДеньСтрокой = ПолучитьПредставлениеДняНедели(ДеньНедели(ТекДата));
		СоответствиеДат.Вставить(ТекДата, ДеньСтрокой);
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	
	Для каждого ЭлементСоответствия Из СоответствиеДат Цикл
		Сообщить("" + Формат(ЭлементСоответствия.Ключ, "ДФ=dd.MM.yyyy") + ": " + ТРег(ЭлементСоответствия.Значение));		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеДняНедели(НомерДня)

	Если НомерДня = 1 Тогда
		ДеньСтрокой = "понедельник";
	ИначеЕсли НомерДня = 2 Тогда    
		ДеньСтрокой = "вторник";
	ИначеЕсли НомерДня = 3 Тогда    
		ДеньСтрокой = "среда";
	ИначеЕсли НомерДня = 4 Тогда    
		ДеньСтрокой = "четверг";
	ИначеЕсли НомерДня = 5 Тогда    
		ДеньСтрокой = "пятница";
	ИначеЕсли НомерДня = 6 Тогда    
		ДеньСтрокой = "суббота";
	ИначеЕсли НомерДня = 7 Тогда    
		ДеньСтрокой = "воскресенье";
	Иначе
		ДеньСтрокой = Неопределено;
	КонецЕсли;
	
	Возврат ДеньСтрокой;
	
КонецФункции

&НаКлиенте
Процедура УбратьПовторяющиесяСимволы(Команда)
	
	//Вводится строка. Требуется удалить из нее повторяющиеся символы и все пробелы. 
	//Например, если было введено "abc cde def", то должно быть выведено "abcdef".
	
	ИсходнаяСтрока = "abc cde def";
	СтрокаБезДублей = "";
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	Для НомерСимвола=1 По ДлинаСтроки Цикл
		ТекСимвол = Сред(ИсходнаяСтрока,НомерСимвола, 1);
		РезультатПоиска = СтрНайти(СтрокаБезДублей, ТекСимвол);
		Если РезультатПоиска = 0 Тогда
			СтрокаБезДублей = СтрокаБезДублей + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить(СтрокаБезДублей);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийКакОбратиться(Команда)
	
	ТаблицаЗначенийКакОбратитьсяНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЗначенийКакОбратитьсяНаСервере()

	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Наименование");	
	ТаблицаТоваров.Колонки.Добавить("Артикул");	
	ТаблицаТоваров.Колонки.Добавить("Цена");	
	
	ДобавитьСтрокуВТаблицуЗначений(ТаблицаТоваров, "Кирпич", "А-101", 25);
	ДобавитьСтрокуВТаблицуЗначений(ТаблицаТоваров, "Штукатурка", "К-102", 125);
	ДобавитьСтрокуВТаблицуЗначений(ТаблицаТоваров, "Краска", "Б-14", 200);
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуЗначений(ТаблицаТоваров, Наименование, Артикул, Цена)

	НоваяСтрока = ТаблицаТоваров.Добавить();
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Артикул = Артикул;
	НоваяСтрока.Цена = Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПользователю(Команда)
	
	ТекстВопроса = "Документ будет записан. Продолжить?";
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 10);
	

КонецПроцедуры
	
	
	
	
	
	

	