
&НаКлиенте
Процедура ПрочитатьКонстанту(Команда)
	ПрочитатьКонстантуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКонстантуНаСервере()
	
	Заголовок = Константы.ЗаголовокПрограммы.Получить();
	Сообщить(Заголовок);
	
	//другой вариант
	МенеджерВсехконстант = Константы;
	МенеджерКонстантыЗаголовок = МенеджерВсехконстант.ЗаголовокПрограммы;
	Заголовок = МенеджерКонстантыЗаголовок.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКонстанту(Команда)
	УстановитьКонстантуНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьКонстантуНаСервере()
	
	Константы.ЗаголовокПрограммы.Установить("Электроник ООО");
	Сообщить("Значение константы изменено");
	
КонецПроцедуры
