
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//1. Создать новый табличный документ
	ТабДок = Новый ТабличныйДокумент;
	
	ОбработкаКомандыНаСервере(ПараметрКоманды, ТабДок);  
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	// показать печатную форму пользователю
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыНаСервере(МассивДокументов, ТабДок)
	
	Документы.АктВыполненныхРабот.ПечатьАктаВыполненныхРабот(МассивДокументов, ТабДок);
	
КонецПроцедуры // ОбработкаКомандыНаСервере()
