			  
#Область Задача1
			  
&НаКлиенте
Процедура ЗаполнитьВидКонтрагентов(Команда)
	ЗаполнитьВидКонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидКонтрагентовНаСервере()
	
	//1. Для всех контрагентов из справочника «Контрагенты» заполнить реквизит «ВидКонтрагента» значением «Юридическое лицо» 
	
КонецПроцедуры  

#КонецОбласти

#Область Задача2

&НаКлиенте
Процедура ИзменитьЮридическийАдрес(Команда)
	ИзменитьЮридическийАдресНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьЮридическийАдресНаСервере()
	
	//2. Для контрагента «Радуга плюс» (ИНН 123456789) нужно изменить юридический адрес, 
	//установив нового значение: «124034, Москва, ул. Никольская, 132, оф. 405»

КонецПроцедуры

#КонецОбласти

#Область Задача3

&НаКлиенте
Процедура ПолучениеСпискаКонстант(Команда)
	ПолучениеСпискаКонстантНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучениеСпискаКонстантНаСервере()
	
	//3. Нужно получить и показать пользователю в виде сообщений список всех констант, которые определены в текущей конфигурации (подсказка: используйте свойство глобального контекста Метаданные).
	//В результате пользователь должен увидеть примерно такой результат:
	//"В текущей конфигурации используются следующие константы:
	//- Константа "ЗаголовокПрограммы"
	//- Константа "ДатаЗапретаРедактирования"
	//…
	
	
КонецПроцедуры

#КонецОбласти

#Область Задача4

&НаКлиенте
Процедура ПоискВалютПоСпособуУстановкиКурса(Команда)
	ПоискВалютПоСпособуУстановкиКурсаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискВалютПоСпособуУстановкиКурсаНаСервере()
	//4. В справочнике "Валюты" найти все валюты, для которых установлен 
	//способ установки курса "Загружается из интернета" 
	//и показать их пользователю в виде сообщений.
КонецПроцедуры

#КонецОбласти

#Область Задача5

&НаСервере
Процедура КоличествоЭлементовВСправочникеНоменклатураНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭлементовВСправочникеНоменклатура(Команда)
	КоличествоЭлементовВСправочникеНоменклатураНаСервере();
КонецПроцедуры

#КонецОбласти
